
#Область СлужебныйПрограммныйИнтерфейс

#Область РазрешительныйРежимРозничнойПродажи

// Возвращает параметры включения аварийного режима
// 
// Возвращаемое значение:
//  см. ПараметрыАварийногоРежима
Функция ДанныеНастройкиАварийногоРежима() Экспорт
	
	ДанныеАварийногоРежима = ПараметрыАварийногоРежима();
	
	ДанныеАварийногоРежима.ДатаОкончания = 
		ОбщегоНазначенияИСМПВызовСервера.НастройкиСканированияКодовМаркировки().АварийноеОтключенияРазрешительногоРежимаДоУниверсальнаяДата;
	
	Если ТекущаяУниверсальнаяДата() < ДанныеАварийногоРежима.ДатаОкончания Тогда
		ДанныеАварийногоРежима.Включено = Истина;
	Иначе
		ДанныеАварийногоРежима.ДатаОкончания = Дата(1, 1, 1);
	КонецЕсли;
	
	Возврат ДанныеАварийногоРежима;
	
КонецФункции

// Возвращает признак, поддерживает ли БПО логирование проверок КМ и проверку КМ единым методом
// 
// Возвращаемое значение:
//  Булево - Истина, если версия БПО выше 3.2.2.24
Функция ВерсияБПОПоддерживаетПроверкуКМЕдинымМетодом() Экспорт
	
	ВерсияБПО        = МенеджерОборудованияВызовСервера.ВерсияБиблиотеки();
	Возврат ОбщегоНазначенияКлиентСервер.СравнитьВерсии(ВерсияБПО, "3.2.2.24") >= 0;
	
КонецФункции

// Возвращает признак, нужно ли писать данные успешных операций сканирования в РС ОперацииПроверкиКМ при настройке
// Проверка кодов маркировки средствами ККТ = Перед пробитием чека
// 
// Возвращаемое значение:
//  Булево - Истина, если установлена нужная версия БПО, есть где хранить логи, Проверка кодов маркировки средствами ККТ = Перед пробитием чека и
//  включена настройка Хранить успешные операции при разрешительном режиме
Функция ХранитьУспешныеОперацииПриПроверкеКМ() Экспорт
	
	ВерсияБПО        = МенеджерОборудованияВызовСервера.ВерсияБиблиотеки();
	
	Если Не ОбщегоНазначенияКлиентСервер.СравнитьВерсии(ВерсияБПО, "3.2.2.24") >= 0 Тогда
		Возврат Ложь;
	Иначе
		
		//@skip-check wrong-string-literal-content
		МодульМенеджерОборудованияМаркировка = ОбщегоНазначения.ОбщийМодуль("МенеджерОборудованияМаркировка");
		//@skip-check unknown-method-property
		Возврат МодульМенеджерОборудованияМаркировка.ХранитьУспешныеОперацииРазрешения();
		
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область РазрешительныйРежимРозничнойПродажи

// Настройки аварийного режима разрешительной системы розничных продаж
// 
// Возвращаемое значение:
//  Структура - Параметры аварийного режима:
// * ДатаОкончания - Дата - универсальная дата окончания аварийного режима
// * Включено - Булево - признак активности аварийного режима
Функция ПараметрыАварийногоРежима() Экспорт
	
	СтруктураВозврата = Новый Структура();
	
	СтруктураВозврата.Вставить("ДатаОкончания", Дата(1, 1, 1));
	СтруктураВозврата.Вставить("Включено",      Ложь);
	
	Возврат СтруктураВозврата;
	
КонецФункции

#КонецОбласти

#КонецОбласти

