
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УчетнаяЗапись        = Параметры.УчетнаяЗапись;
	ИмяОбъектаМетаданных = Параметры.ИмяОбъектаМетаданных;
	ИмяТабличнойЧасти    = Параметры.ИмяТабличнойЧасти;
	
	Если Не ЗначениеЗаполнено(УчетнаяЗапись) Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(Параметры.ДополнительныеПараметры) = Тип("Структура")
			И Параметры.ДополнительныеПараметры.Свойство("ЗначенияПараметровСсылкиНаОбъект") Тогда
		ДанныеУчетнойЗаписи = Параметры.ДополнительныеПараметры.ЗначенияПараметровСсылкиНаОбъект;
	Иначе
		ДанныеУчетнойЗаписи = ИнтеграцияСЯндексМаркетВызовСервера.ДанныеУчетнойЗаписиЯндексМаркет(Параметры.УчетнаяЗапись);
	КонецЕсли;
	
	СпособыОтраженияПродаж = ИнтеграцияСЯндексМаркетКлиентСервер.КонстантыСервиса();
	СпособОтраженияПродаж  = ДанныеУчетнойЗаписи.ДополнительныеНастройки.Получить("СпособОтраженияПродаж");
	
	Если СпособОтраженияПродаж = Неопределено Тогда
		СпособОтраженияПродаж = СпособыОтраженияПродаж["СпособОтраженияПродажРеализация"];
	КонецЕсли;
	
	Если СпособОтраженияПродаж = СпособыОтраженияПродаж["СпособОтраженияПродажРеализация"] Тогда
		СхемаКомпоновкиДанных = Обработки.УправлениеПродажамиНаЯндексМаркет.ПолучитьМакет("СводныйОтчетДляСпособаРеализация");
	ИначеЕсли СпособОтраженияПродаж = СпособыОтраженияПродаж["СпособОтраженияПродажКомиссия"] Тогда
		СхемаКомпоновкиДанных = Обработки.УправлениеПродажамиНаЯндексМаркет.ПолучитьМакет("СводныйОтчетДляСпособаКомиссия");
	Иначе
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	ЗначениеПараметра = СхемаКомпоновкиДанных.Параметры.Найти("СопоставленныеДанные");
	ЗначениеПараметра.Значение = Параметры.ТаблицаСопоставленияДанных.Выгрузить().Скопировать();
	
	КомпоновкаДанныхСервер.УстановитьПараметрСКД(СхемаКомпоновкиДанных, 
		"ЗагруженныеОбъекты", 
		Параметры.ЗагруженныеОбъекты, 
		Истина);
	КомпоновкаДанныхСервер.УстановитьПараметрСКД(СхемаКомпоновкиДанных, 
		"Организация", 
		ДанныеУчетнойЗаписи.Организация, 
		Истина);
	
	Если СпособОтраженияПродаж = СпособыОтраженияПродаж["СпособОтраженияПродажРеализация"] Тогда
		КомпоновкаДанныхСервер.УстановитьПараметрСКД(СхемаКомпоновкиДанных, 
			"Склад", 
			ДанныеУчетнойЗаписи.ДополнительныеНастройки.Получить("СкладОтгрузки"), 
			Истина);
		КомпоновкаДанныхСервер.УстановитьПараметрСКД(СхемаКомпоновкиДанных, 
			"КомментарийНевыкупТоваров",
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = '(Яндекс Маркет) %1. Невыкуп товаров'"),
				ДанныеУчетнойЗаписи.Представление) + "%", Истина);
																			
	Иначе
		КомпоновкаДанныхСервер.УстановитьПараметрСКД(СхемаКомпоновкиДанных, 
			"Партнер", 
			ДанныеУчетнойЗаписи.Партнер, 
			Истина);
		КомпоновкаДанныхСервер.УстановитьПараметрСКД(СхемаКомпоновкиДанных, 
			"Контрагент", 
			ДанныеУчетнойЗаписи.Контрагент, 
			Истина);
	КонецЕсли;
	
	КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных;
	КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновкиДанных));
	КомпоновщикНастроек.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
	КомпоновщикНастроек.Восстановить(СпособВосстановленияНастроекКомпоновкиДанных.ПроверятьДоступность);
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, 
		КомпоновщикНастроек.ПолучитьНастройки(), 
		,,
		Тип("ГенераторМакетаКомпоновкиДанных"));
		
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки,,, Истина);
	
	Результат.Очистить();
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(Результат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
КонецПроцедуры

#КонецОбласти
