#Область ПрограммныйИнтерфейс

// Определяет включено ли ведение учета продукции, подлежащей маркированию.
//
// Возвращаемое значение:
//  Булево - Истина, если учет ведется.
Функция ВедетсяУчетМаркируемойПродукции() Экспорт
	
	УчитываемыеВидыМаркируемойПродукции = ИнтеграцияИС.УчитываемыеВидыМаркируемойПродукции();
	
	Возврат УчитываемыеВидыМаркируемойПродукции.Количество() > 0;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Возвращает структуру реквизитов справочника.
//
// Параметры:
//		ИмяСправочника - Строка - имя справочника как оно задано в метаданных
// Возвращаемое значение:
//		Структура - стандартные и обычные реквизиты справочника.
//
Функция РеквизитыСправочника(ИмяСправочника) Экспорт
	
	СтруктураРеквизитов   = Новый Структура;
	МетаданныеСправочника = Метаданные.Справочники[ИмяСправочника];
	
	Для Каждого Реквизит Из МетаданныеСправочника.СтандартныеРеквизиты Цикл
		СтруктураРеквизитов.Вставить(Реквизит.Имя, Реквизит.Синоним);
	КонецЦикла;
	
	Для Каждого Реквизит Из МетаданныеСправочника.Реквизиты Цикл
		СтруктураРеквизитов.Вставить(Реквизит.Имя, Реквизит.Синоним);
	КонецЦикла;
	
	Возврат СтруктураРеквизитов;

КонецФункции

Функция GTINНабораИВложенийПринадлежатОднойНоменклатуре(GTINНабора, GTINВложений) Экспорт
	
	EANНабора = РазборКодаМаркировкиИССлужебныйКлиентСерверПовтИсп.ШтрихкодEANИзGTIN(GTINНабора);
	EANВложений = РазборКодаМаркировкиИССлужебныйКлиентСерверПовтИсп.ШтрихкодEANИзGTIN(GTINВложений);
	
	ШтрихкодыEAN = Новый Массив;
	ШтрихкодыEAN.Добавить(EANНабора);
	ШтрихкодыEAN.Добавить(EANВложений);
	
	GTINПотребительскихУпаковок = Новый Соответствие;
	GTINПотребительскихУпаковок.Вставить(EANВложений, Истина);
	
	ИнформацияПоШтрихкодамEAN = ШтрихкодированиеОбщегоНазначенияИС.ДанныеПоШтрихкодамEAN(ШтрихкодыEAN, Неопределено, GTINПотребительскихУпаковок);
	
	Наборы = Новый Массив;
	Для Каждого СтрокаТЧ Из ИнформацияПоШтрихкодамEAN Цикл
		Если СтрокаТЧ.ВидУпаковкиИС = Перечисления.ВидыУпаковокИС.Набор Тогда
			Наборы.Добавить(СтрокаТЧ);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого СтрокаТЧ Из ИнформацияПоШтрихкодамEAN Цикл
		
		Если СтрокаТЧ.ВидУпаковкиИС <> Перечисления.ВидыУпаковокИС.Потребительская Тогда
			Продолжить;
		КонецЕсли;
		
		Для Каждого Набор Из Наборы Цикл
			Если Набор.Номенклатура = СтрокаТЧ.Номенклатура
				И Набор.Характеристика = СтрокаТЧ.Характеристика Тогда
				Возврат Истина;
			КонецЕсли;
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

Функция ВидПродукцииПоНоменклатуре(Номенклатура) Экспорт
	Возврат ИнтеграцияИС.ВидПродукцииПоНоменклатуре(Номенклатура);
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ВскрытеПотребительскиеУпаковки

Функция ПредставленияВскрытыхПотребительскихУпаковок(ИмяПодсистемы) Экспорт
	
	ВозвращаемоеЗначение = Новый Структура();
	ВозвращаемоеЗначение.Вставить("ЗаголовокСписка", НСтр("ru='Вскрытые потребительские упаковки ИС МП'"));
	ВозвращаемоеЗначение.Вставить("ЗаголовокЗаписи", НСтр("ru='Вскрытие потребительской упаковки ИС МП'"));
	
	ВидыПродукции = ИнтеграцияИСВызовСервера.ВидыПродукцииИспользующиеВскрытыеПотребительскихУпаковок(
		ИмяПодсистемы = "ИСМП", ИмяПодсистемы = "ЕГАИС");
	
	Если ИмяПодсистемы = "ИСМП" Тогда
		
		Если ВидыПродукции.Количество() = 1
			И (ВидыПродукции[0] = Перечисления.ВидыПродукцииИС.Пиво
				Или ВидыПродукции[0] = Перечисления.ВидыПродукцииИС.ПивоВПотребительскихУпаковках) Тогда
			
			ВозвращаемоеЗначение.ЗаголовокСписка = НСтр("ru='Кеги на оборудовании розлива ИС МП'");
			ВозвращаемоеЗначение.ЗаголовокЗаписи = НСтр("ru='Подключение кега к оборудованию розлива'");
			
		КонецЕсли;
		
	ИначеЕсли ИмяПодсистемы = "ЕГАИС" Тогда
		
		ВозвращаемоеЗначение.ЗаголовокСписка = НСтр("ru='Вскрытые бутылки ЕГАИС'");
		ВозвращаемоеЗначение.ЗаголовокЗаписи = НСтр("ru='Вскрытие бутылки ЕГАИС'");
		
	КонецЕсли;
	
	Возврат Новый ФиксированнаяСтруктура(ВозвращаемоеЗначение);
	
КонецФункции

#КонецОбласти

#КонецОбласти