//@strict-types

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ИспользуютсяСегменты = ПолучитьФункциональнуюОпцию("ИспользоватьСегментыПартнеров");
	
	ДанныеВыбора = Новый СписокЗначений; // СписокЗначений из ПеречислениеСсылка.СоставыУчастниковРетроБонусов
	ДанныеВыбора.Добавить(ИНН);
	ДанныеВыбора.Добавить(Контрагенты);
	ДанныеВыбора.Добавить(Клиенты);
	Если ИспользуютсяСегменты Тогда
		ДанныеВыбора.Добавить(СегментыПартнеров);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
