
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	ТекстСообщенияXML = ПротоколОбменаИС.ТекстСообщенияXMLИзПротокола(Объект.Ссылка);
	ТекстСообщенияXML = РаботаСXMLИС.ФорматироватьXMLСПараметрами(
		ТекстСообщенияXML,
		РаботаСXMLИС.ПараметрыФорматированияXML(Истина, "  "));

	ТекстовыйДокументТекстСообщенияXML.УстановитьТекст(ТекстСообщенияXML);
	
	РежимОтладки = ОбщегоНазначения.РежимОтладки();
	
	Элементы.ГруппаШапка.ТолькоПросмотр = Не РежимОтладки;
	Элементы.ГруппаСообщение.ТолькоПросмотр = Не РежимОтладки;
	
	ОбщегоНазначенияСобытияФормИСПереопределяемый.ПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти