#Область ПрограммныйИнтерфейс

// Возващает двоичные данные как пробразование по формату multipart/form-data.
//
// Параметры:
//  ПоляФормы - Массив из Структура:
//   * ИмяПоля  - Строка - Имя поля формы.
//   * ИмяФайла - Строка - Имя файла.
//   * Тип      - Строка - Тип содержимого.
//   * Тело     - Строка - Содержание поля.
// Возвращаемое значение:
//  Структура - представление вебзапроса типа multipart/form-data:
//   * ДвоичныеДанные - ДвоичныеДанные - Результат преобразования.
//   * Размер         - Число          - Размер данных.
//   * Разделитель    - Строка         - Разделитель полей.
Функция ДвоичныеДанныеPOSTЗапросаКакФорма(ПоляФормы) Экспорт
	
	ВозвращаемоеЗначение = Новый Структура();
	ВозвращаемоеЗначение.Вставить("ДвоичныеДанные", Неопределено);
	ВозвращаемоеЗначение.Вставить("Размер",         0);
	ВозвращаемоеЗначение.Вставить("Разделитель",    "");
	
	Разделитель = СтрЗаменить(Строка(Новый УникальныйИдентификатор()), "-", "");
	
	НаборСтрок = Новый Массив;
	РазделительСтрок = Символы.ВК + Символы.ПС;
	
	ТекущийИндекс = 0;
	Для Каждого ПолеФормы Из ПоляФормы Цикл
		
		ОписаниеСодержимого = СтрШаблон(
			"Content-Disposition: form-data; name=""%1""; filename=""%2""",
			ПолеФормы.ИмяПоля,
			ПолеФормы.ИмяФайла);
		ОписаниеТипа = СтрШаблон("Content-Type: %1", ПолеФормы.Тип);
		
		НаборСтрок.Добавить("--" + Разделитель);
		НаборСтрок.Добавить(ОписаниеСодержимого);
		НаборСтрок.Добавить(ОписаниеТипа);
		НаборСтрок.Добавить("");
		НаборСтрок.Добавить(ПолеФормы.Тело);
		Если ТекущийИндекс = ПоляФормы.ВГраница() Тогда
			НаборСтрок.Добавить("--" + Разделитель + "--");
		Иначе
			НаборСтрок.Добавить("--" + Разделитель);
		КонецЕсли;
		
		ТекущийИндекс = ТекущийИндекс + 1;
		
	КонецЦикла;
	
	ВозвращаемоеЗначение.ДвоичныеДанные = ПолучитьДвоичныеДанныеИзСтроки(СтрСоединить(НаборСтрок,РазделительСтрок));
	
	ВозвращаемоеЗначение.Размер      = ВозвращаемоеЗначение.ДвоичныеДанные.Размер();
	ВозвращаемоеЗначение.Разделитель = Разделитель;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

#КонецОбласти