#Область ПрограммныйИнтерфейс

Функция ЭтоРасширеннаяВерсияГосИС(Подсистема = Неопределено) Экспорт
	
	Возврат ОбщегоНазначенияИС.ЭтоРасширеннаяВерсияГосИС(Подсистема);
	
КонецФункции

// Возвращает признак ведения учета маркируемой продукции.
// 
// Возвращаемое значение:
// 	Булево - Истина, если учет маркируемой продукции используется.
//
Функция ИспользуетсяМаркируемаяПродукция() Экспорт
	
	Возврат ОбщегоНазначенияИСМП.ИспользуетсяМаркируемаяПродукция();
	
КонецФункции

#Область ОбработкаОшибок

// Выполняет запись ошибки в журнал регистрации, добавляя имя события ГосИС если оно не задано.
//
// Параметры:
//  ТекстОшибки      - Строка           - текст ошибки.
//  ИмяСобытия       - Строка           - имя события.
//  ОбъектМетаданных - ОбъектМетаданных - объект метаданных с ошибкой.
//  Данные           - Произвольный     - объект данных с ошибкой.
//
Процедура ЗаписатьОшибкуВЖурналРегистрации(ТекстОшибки, ИмяСобытия = Неопределено, ОбъектМетаданных = Неопределено, Данные = Неопределено) Экспорт
	
	Если ИмяСобытия = Неопределено Тогда
		ИмяСобытия = НСтр("ru='ГосИС'", ОбщегоНазначения.КодОсновногоЯзыка());
	КонецЕсли;
	
	ЗаписьЖурналаРегистрации(
		ИмяСобытия,
		УровеньЖурналаРегистрации.Ошибка,
		ОбъектМетаданных,
		Данные,
		ТекстОшибки);
	
КонецПроцедуры

#КонецОбласти

#Область ЧастичноеВыбытие

// Возвращает признак возможности для вида продукции участвовать в частичном выбытии.
// 
// Параметры:
//  ВидПродукции - ПеречислениеСсылка.ВидыПродукцииИС                - вид маркируемой продукции.
//  ОперацияИС   - ПеречислениеСсылка.ВидыОперацийИСМП, ПеречислениеСсылка.ВидыДокументовЕГАИС, Неопределено - вид операции ИСМП.
// Возвращаемое значение:
//  Булево - Вид продукци может выбывать частично.
Функция ПоддерживаетсяЧастичноеВыбытие(ВидПродукции, ОперацияИС = Неопределено) Экспорт
		
	Если ВидПродукции = Перечисления.ВидыПродукцииИС.Алкогольная Тогда
		Если Не ОбщегоНазначения.ПодсистемаСуществует("ГосИС.ЕГАИС") Тогда
			Возврат Ложь;
		КонецЕсли;
		МодульОбщегоНазначенияЕГАИСКлиентСервер = ОбщегоНазначения.ОбщийМодуль("ОбщегоНазначенияЕГАИСКлиентСервер");
		Возврат МодульОбщегоНазначенияЕГАИСКлиентСервер.ПоддерживаетсяЧастичноеВыбытие(ВидПродукции, ОперацияИС);
	Иначе
		Если Не ОбщегоНазначенияИСПовтИсп.ЭтоПродукцияИСМП(ВидПродукции, Истина)
			Или Не ОбщегоНазначения.ПодсистемаСуществует("ГосИС.ИСМП") Тогда
			Возврат Ложь;
		КонецЕсли;
		МодульОбщегоНазначенияИСМПКлиентСерверПовтИсп = ОбщегоНазначения.ОбщийМодуль("ОбщегоНазначенияИСМПКлиентСерверПовтИсп");
		Возврат МодульОбщегоНазначенияИСМПКлиентСерверПовтИсп.ПоддерживаетсяЧастичноеВыбытие(
			ВидПродукции,
			ОперацияИС);
	КонецЕсли;
	
КонецФункции

#КонецОбласти

// см. ОбщегоНазначения.ЗначениеРеквизитаОбъектов
//
Функция ЗначениеРеквизитаОбъектов(МассивСсылок, ИмяРеквизита, ВыбратьРазрешенные = Ложь) Экспорт
	
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъектов(МассивСсылок, ИмяРеквизита, ВыбратьРазрешенные);
	
КонецФункции

// Классифицирует текущий сеанс, как сеанс, запущенный в фоновом задании в клиент-серверном варианте, в остальных
// случаях, сеанс имеет ту же файловую систему на стороне сервера, что и основной сеанс.
//	
// Возвращаемое значение:
// 	Булево - Описание
Функция ЭтоФоновоеЗаданиеНаСервере() Экспорт
	
	Если ПолучитьТекущийСеансИнформационнойБазы().ПолучитьФоновоеЗадание() <> Неопределено
		И Не ОбщегоНазначения.ИнформационнаяБазаФайловая() Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

// см. ОбщегоНазначенияИС.СертификатыПользователяДляПодписиПоОрганизации
Функция СертификатыПользователяДляПодписиПоОрганизации(Организация, ВключатьСертификатыБезОрганизации = Ложь, ВключатьСертификатыФЛ = Ложь) Экспорт
	Возврат ОбщегоНазначенияИС.СертификатыПользователяДляПодписиПоОрганизации(Организация, ВключатьСертификатыБезОрганизации, ВключатьСертификатыФЛ);
КонецФункции

#КонецОбласти