
#Область ПрограммныйИнтерфейс

#Область РазрешительныйРежимCDNПлощадки

// Запуск актуализации списка CDN-площадок. При необходимости проверяет, требуется ли обновление по времени
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма-источник
//  Организация - СправочникСсылка.Организации - организация, от имени которой выполняется запрос к ГИС МТ
//  ДополнительныеПараметры - Неопределено, Структура - Дополнительные параметры
//  ОповещениеПриЗавершении - Неопределено, ОписаниеОповещения - процедура, вызываемая при завершении
Процедура АктуализироватьСписокCDNПлощадок(Форма, Организация, ДополнительныеПараметры = Неопределено, ОповещениеПриЗавершении = Неопределено) Экспорт
	
	Если ДополнительныеПараметры <> Неопределено
		И ДополнительныеПараметры.Свойство("ПроверитьНеобходимостьОбновления")
		И ДополнительныеПараметры.ПроверитьНеобходимостьОбновления Тогда
			
		НеобходимоОбновлять = ОбщегоНазначенияИСМПВызовСервера.ПроверитьНеобходимостьОбновленияCDNПлощадок();
		
		Если Не НеобходимоОбновлять Тогда
			
			Если ОповещениеПриЗавершении <> Неопределено Тогда
				ВыполнитьОбработкуОповещения(ОповещениеПриЗавершении);
			КонецЕсли;
			
			Возврат;
			
		КонецЕсли;
		
	КонецЕсли;
	
	РезультатОбновления = ОбщегоНазначенияИСМПВызовСервера.ЗапуститьОбновлениеCDNПлощадок(Организация, Форма.УникальныйИдентификатор);
	
	ОбработатьРезультатАктуализацииCDNПлощадок(
		РезультатОбновления, Форма, Организация, Неопределено, ОповещениеПриЗавершении);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область РазрешительныйРежимCDNПлощадки

Процедура ПослеЗавершенияДлительнойОперации(Результат, ДополнительныеПараметрыДлительнойОперации) Экспорт
	
	Если Результат = Неопределено Тогда // отменено пользователем
		Если ДополнительныеПараметрыДлительнойОперации.ОповещениеПриЗавершении <> Неопределено Тогда
			ВыполнитьОбработкуОповещения(ДополнительныеПараметрыДлительнойОперации.ОповещениеПриЗавершении);
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	Если Результат.Сообщения <> Неопределено Тогда
		Для каждого СообщениеПользователю Из Результат.Сообщения Цикл
			СообщениеПользователю.Сообщить();
		КонецЦикла;
	КонецЕсли;
	
	Если Результат.Статус = "Выполнено" Тогда
		
		РезультатОбмена = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
		
		ОбработатьРезультатОбменаСлужебный(РезультатОбмена, ДополнительныеПараметрыДлительнойОперации);
		
	ИначеЕсли Результат.Статус = "Ошибка" Тогда
		
		ОбщегоНазначенияКлиент.СообщитьПользователю(Результат.ПодробноеПредставлениеОшибки);
		
		Если ДополнительныеПараметрыДлительнойОперации.ОповещениеПриЗавершении <> Неопределено Тогда
			ВыполнитьОбработкуОповещения(ДополнительныеПараметрыДлительнойОперации.ОповещениеПриЗавершении, Новый Массив);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработатьРезультатАктуализацииCDNПлощадок(РезультатОбмена, Форма, Организация, Контекст = Неопределено, ОповещениеПриЗавершении = Неопределено, ВыводитьОкноОжидания = Истина) Экспорт
	
	Если РезультатОбмена <> Неопределено Тогда
		
		ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(Неопределено);
		ПараметрыОжидания.ТекстСообщения             = НСтр("ru='Выполняется обновление CDN-площадок'");
		ПараметрыОжидания.ВыводитьПрогрессВыполнения = Истина;
		ПараметрыОжидания.ВыводитьОкноОжидания       = ВыводитьОкноОжидания;
		ПараметрыОжидания.ВыводитьСообщения          = Истина;
		
		ПараметрыЗавершенияДлительнойОперации = ПараметрыЗавершенияДлительнойОперации();
		ПараметрыЗавершенияДлительнойОперации.Форма                   = Форма;
		ПараметрыЗавершенияДлительнойОперации.Контекст                = Контекст;
		ПараметрыЗавершенияДлительнойОперации.ОповещениеПриЗавершении = ОповещениеПриЗавершении;
		ПараметрыЗавершенияДлительнойОперации.Организация             = Организация;
		
		ДлительныеОперацииКлиент.ОжидатьЗавершение(
			РезультатОбмена,
			Новый ОписаниеОповещения("ПослеЗавершенияДлительнойОперации", ОбщегоНазначенияИСМПКлиент, ПараметрыЗавершенияДлительнойОперации),
			ПараметрыОжидания);
		
	КонецЕсли;
	
КонецПроцедуры

// Только для внутреннего использования.
Процедура ОбработатьРезультатОбменаСлужебный(РезультатОбмена, ДополнительныеПараметрыДлительнойОперации)
	
	Если РезультатОбмена.ЕстьОшибки Тогда
		Возврат;
	КонецЕсли;
	
	Если РезультатОбмена.ТребуетсяОбновлениеКлючаСессииРозница Тогда
		
		ОписаниеОповещения = Новый ОписаниеОповещения("АвторизацияПользователяЗавершение",
			ЭтотОбъект, ДополнительныеПараметрыДлительнойОперации);
		
		ПараметрыЗапросаКлючаСессии = ИнтерфейсИСМПОбщегоНазначенияКлиентСервер.ПараметрыЗапросаКлючаСессииИСМПРозница(ДополнительныеПараметрыДлительнойОперации.Организация);
		ИнтерфейсАвторизацииИСМПКлиент.ЗапроситьКлючСессии(ПараметрыЗапросаКлючаСессии, ОписаниеОповещения);
		
		Возврат;
		
	КонецЕсли;
	
КонецПроцедуры

// Выполняет повторно вызов клиентских функий актуализации CDN-площадок в случае успешного прохождения авторизации.
// 
// Параметры:
// 	Результат - Соответствие из КлючИЗначение - содержит информация о необходимости авторизации по организации.
// 	ДополнительныеПараметры - (См. ПараметрыЗавершенияДлительнойОперации).
Процедура АвторизацияПользователяЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(Результат) <> Тип("Соответствие") Тогда
		Возврат;
	КонецЕсли;
	
	Организация = ДополнительныеПараметры.Организация;
	
	АвторизацияПрошлаУспешно = Результат[Организация] = Истина;
	
	Если АвторизацияПрошлаУспешно Тогда
		
		АктуализироватьСписокCDNПлощадок(ДополнительныеПараметры.Форма,
			ДополнительныеПараметры.Организация,,
			ДополнительныеПараметры.ОповещениеПриЗавершении);
		
	Иначе
		
		ВозвращаемоеЗначение = Новый Структура();
		ВозвращаемоеЗначение.Вставить("ТребуетсяОбновлениеКлючаСессииРозница", Истина);
		
		ВыполнитьОбработкуОповещения(ДополнительныеПараметры.ОповещениеПриЗавершении, ВозвращаемоеЗначение);
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПараметрыЗавершенияДлительнойОперации()
	
	ПараметрыЗавершения = Новый Структура;
	ПараметрыЗавершения.Вставить("Форма");
	ПараметрыЗавершения.Вставить("Контекст");
	ПараметрыЗавершения.Вставить("ОповещениеПриЗавершении");
	ПараметрыЗавершения.Вставить("Организация");
	
	Возврат ПараметрыЗавершения;
	
КонецФункции

#КонецОбласти

#КонецОбласти
