//@strict-types

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	ТипДанныхЗаполнения = ТипЗнч(ДанныеЗаполнения);
	
	Если ТипДанныхЗаполнения = Тип("ДокументСсылка.УсловияРетроБонусовКлиентов") Тогда
		
		СсылкаНаДокумент = ДанныеЗаполнения; // ДокументСсылка.УсловияРетроБонусовКлиентов
		ЗаполнитьПоУсловиюРетроБонусовКлиентов(СсылкаНаДокумент);
		
	КонецЕсли;
	
	ИнициализироватьДокумент();
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ЗначениеЗаполнено(НачалоДействия)
	   И ЗначениеЗаполнено(ОкончаниеДействия)
	   И ОкончаниеДействия < НачалоДействия Тогда
		
		ТекстСообщения = НСтр("ru = 'Дата окончания действия должна быть не меньше даты начала действия'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, "ОкончаниеДействия",, Отказ);
		
	КонецЕсли;
	
	МассивНепроверяемыхРеквизитов = Новый Массив; // Массив Из Строка
	
	Если ВидРетроБонуса.Пустая() Тогда
		
		МассивНепроверяемыхРеквизитов.Добавить("ОтборУчастников");
		МассивНепроверяемыхРеквизитов.Добавить("ОтборТоваров");
		МассивНепроверяемыхРеквизитов.Добавить("ПериодичностьУсловий");
		МассивНепроверяемыхРеквизитов.Добавить("ПериодичностьНачислений");
		МассивНепроверяемыхРеквизитов.Добавить("СуммаПлан");
		МассивНепроверяемыхРеквизитов.Добавить("БонусПроцент");
		МассивНепроверяемыхРеквизитов.Добавить("Валюта");
		
		МассивНепроверяемыхРеквизитов.Добавить("Контрагенты");
		МассивНепроверяемыхРеквизитов.Добавить("ИННКонтрагентов");
		МассивНепроверяемыхРеквизитов.Добавить("СегментыПартнеров");
		МассивНепроверяемыхРеквизитов.Добавить("Товары");
		МассивНепроверяемыхРеквизитов.Добавить("СегментыТоваров");
		
	Иначе
		
		Если ОтборУчастников = Перечисления.СоставыСписковРетроБонусов.Все Тогда
			
			МассивНепроверяемыхРеквизитов.Добавить("Контрагенты");
			МассивНепроверяемыхРеквизитов.Добавить("ИННКонтрагентов");
			МассивНепроверяемыхРеквизитов.Добавить("СегментыПартнеров");
			
		КонецЕсли;
		
		Если ОтборТоваров = Перечисления.СоставыСписковРетроБонусов.Все Тогда
			
			МассивНепроверяемыхРеквизитов.Добавить("Товары");
			МассивНепроверяемыхРеквизитов.Добавить("СегментыТоваров");
			
		КонецЕсли;
		
		РеквизитыВида = ДанныеВидаДокумента();
		
		ЗапретПревышенияПоСумме =
			(РеквизитыВида.ПоказательПродаж = Перечисления.ЦелевыеПоказателиПродажРетроБонусов.Сумма
			 И ЗапретНачисленияСверхПлана);
		Если РеквизитыВида.СоставТоваров = Перечисления.СоставыТоваровРетроБонусов.Номенклатура
		   И ОтборТоваров = Перечисления.СоставыСписковРетроБонусов.Выбранные
		   И НЕ ЗапретПревышенияПоСумме Тогда
			
			МассивНепроверяемыхРеквизитов.Добавить("БонусПроцент");
			
		КонецЕсли;
		
		Если РеквизитыВида.БезРасчета
		 ИЛИ (РеквизитыВида.ПоказательПродаж <> Перечисления.ЦелевыеПоказателиПродажРетроБонусов.НеИспользуется
			  И РеквизитыВида.ПоказательПродаж <> Перечисления.ЦелевыеПоказателиПродажРетроБонусов.Сумма) Тогда
			
			МассивНепроверяемыхРеквизитов.Добавить("БонусПроцент");
			
		КонецЕсли;
		
		ПроверитьЗаполнениеПериодовШапки(РеквизитыВида, Отказ);
		
		Если РеквизитыВида.БезРасчета Тогда
			
			МассивНепроверяемыхРеквизитов.Добавить("ПериодичностьУсловий");
			
		Иначе
			
			МассивНепроверяемыхРеквизитов.Добавить("Контрагенты.СуммаБонус");
			
		КонецЕсли;
		
		Если РеквизитыВида.ПоказательПродаж = Перечисления.ЦелевыеПоказателиПродажРетроБонусов.НеИспользуется Тогда
			
			МассивНепроверяемыхРеквизитов.Добавить("ПериодичностьУсловий");
			
		КонецЕсли;
		
		Если РеквизитыВида.ПоказательПродаж <> Перечисления.ЦелевыеПоказателиПродажРетроБонусов.Сумма Тогда
			
			МассивНепроверяемыхРеквизитов.Добавить("СуммаПлан");
			
		КонецЕсли;
		
		Если РеквизитыВида.БазаРасчетаПродаж <> Перечисления.БазыРасчетаПродажРетроБонусов.ВыручкаБазовыеЦены Тогда
			
			МассивНепроверяемыхРеквизитов.Добавить("Товары.БазоваяЦена");
			
		КонецЕсли;
		
		Если НЕ РеквизитыВида.БезРасчета 
		   И РеквизитыВида.БазаРасчетаПродаж = Перечисления.БазыРасчетаПродажРетроБонусов.ВыручкаВзаиморасчеты Тогда
			
			МассивНепроверяемыхРеквизитов.Добавить("Валюта");
			
		КонецЕсли;
		
		ПроверитьПоСоставуУчастниковКонтрагенты(РеквизитыВида, МассивНепроверяемыхРеквизитов, Отказ);
		ПроверитьПоСоставуУчастниковПартнеры(РеквизитыВида, МассивНепроверяемыхРеквизитов, Отказ);
		ПроверитьПоСоставуУчастниковИНН(РеквизитыВида, МассивНепроверяемыхРеквизитов, Отказ);
		ПроверитьПоСоставуУчастниковСегментыПартнеров(РеквизитыВида, МассивНепроверяемыхРеквизитов, Отказ);
		
		ПроверитьПоСоставуТоваровНоменклатура(РеквизитыВида, МассивНепроверяемыхРеквизитов, Отказ);
		ПроверитьПоСоставуТоваровСегментыНоменклатуры(РеквизитыВида, МассивНепроверяемыхРеквизитов, Отказ);
		
		ПроверитьОграниченияПоНачислениям(РеквизитыВида, Отказ);
		
	КонецЕсли;
	
	ИсправлениеДокументов.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	НоменклатураСервер.ПроверитьЗаполнениеХарактеристик(ЭтотОбъект, МассивНепроверяемыхРеквизитов, Отказ);
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ПланыОбмена.ГлавныйУзел() <> Неопределено Тогда
		
		ТекстСообщения = НСтр("ru = 'Запрещено изменение документа в подчиненном узле обмена'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект,,, Отказ);
		
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	ПроверитьЦепочкуДокументов(РежимЗаписи);
	
	ПропуститьПроверкуИзмененияПоСтатусу = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
		ДополнительныеСвойства,
		"ПропуститьПроверкуИзмененияПоСтатусу",
		Ложь);
	
	РазрешеноИзменение = Истина;
	
	Если НЕ Статус.Пустая()
	   И НЕ ПропуститьПроверкуИзмененияПоСтатусу Тогда
		
		РазрешеноИзменение = Документы.УсловияРетроБонусовКлиентов.РазрешеноИзменениеПоСтатусу(Статус);
		Если НЕ РазрешеноИзменение Тогда
			
			ШаблонОшибки = НСтр("ru = 'Изменение документа в статусе ""%1"" запрещено'");
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонОшибки, Строка(Статус));
			
			ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, ЭтотОбъект, "Статус",, Отказ);
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если НЕ ВидРетроБонуса.Пустая() Тогда
		
		РеквизитыВида = ДанныеВидаДокумента();
		
		Если РеквизитыВида.БезРасчета
		 ИЛИ (РеквизитыВида.ПоказательПродаж <> Перечисления.ЦелевыеПоказателиПродажРетроБонусов.Количество
			  И РеквизитыВида.ПоказательПродаж <> Перечисления.ЦелевыеПоказателиПродажРетроБонусов.Сумма) Тогда
			
			ЗапретНачисленияСверхПлана = Ложь;
			
		КонецЕсли;
		
		Если РеквизитыВида.ПоказательПродаж <> Перечисления.ЦелевыеПоказателиПродажРетроБонусов.Сумма
		 ИЛИ РеквизитыВида.БезРасчета Тогда
			
			СуммаПлан = 0;
			
		КонецЕсли;
		
		ЗапретПревышенияПоСумме =
			(РеквизитыВида.ПоказательПродаж = Перечисления.ЦелевыеПоказателиПродажРетроБонусов.Сумма
			 И ЗапретНачисленияСверхПлана);
		Если РеквизитыВида.БезРасчета
		 ИЛИ (ОтборТоваров = Перечисления.СоставыСписковРетроБонусов.Выбранные
			  И РеквизитыВида.СоставТоваров <> Перечисления.СоставыТоваровРетроБонусов.СегментыНоменклатуры
			  И НЕ ЗапретПревышенияПоСумме) Тогда
			
			БонусПроцент = 0;
			
		КонецЕсли;
		
		ПараметрыУчастников = Документы.УсловияРетроБонусовКлиентов.ПараметрыОчисткиРеквизитовУчастников();
		ПараметрыУчастников.СоставУчастников = РеквизитыВида.СоставУчастников;
		ПараметрыУчастников.ОтборУчастников = ОтборУчастников;
		Документы.УсловияРетроБонусовКлиентов.ОчиститьНеиспользуемыеРеквизитыУчастников(
			ЭтотОбъект, ПараметрыУчастников);
		Документы.УсловияРетроБонусовКлиентов.УстановитьПризнакиРасчетаПланаУчастников(
			ЭтотОбъект, ПараметрыУчастников);
		
		ПараметрыТоваров = Документы.УсловияРетроБонусовКлиентов.ПараметрыОчисткиРеквизитовТоваров();
		ПараметрыТоваров.СоставТоваров = РеквизитыВида.СоставТоваров;
		ПараметрыТоваров.ОтборТоваров = ОтборТоваров;
		ПараметрыТоваров.ПоказательПродаж = РеквизитыВида.ПоказательПродаж;
		ПараметрыТоваров.БазаРасчета = РеквизитыВида.БазаРасчетаПродаж;
		Документы.УсловияРетроБонусовКлиентов.ОчиститьНеиспользуемыеРеквизитыТоваров(ЭтотОбъект, ПараметрыТоваров);
		
	КонецЕсли;
	
	Если НЕ Исправление Тогда
		
		ПустаяДата = Дата(1, 1, 1);
		
		Для Каждого СтрокаТЧ Из Контрагенты Цикл
			
			СтрокаТЧ.СуммаПланДоИзменений = 0;
			СтрокаТЧ.ПланНеУказываетсяДоИзменений = Ложь;
			СтрокаТЧ.НачалоДействияДоИзменений = ПустаяДата;
			СтрокаТЧ.ОкончаниеДействияДоИзменений = ПустаяДата;
			
		КонецЦикла;
		
		Для Каждого СтрокаТЧ Из ИННКонтрагентов Цикл
			
			СтрокаТЧ.СуммаПланДоИзменений = 0;
			СтрокаТЧ.НачалоДействияДоИзменений = ПустаяДата;
			СтрокаТЧ.ОкончаниеДействияДоИзменений = ПустаяДата;
			
		КонецЦикла;
		
		Для Каждого СтрокаТЧ Из Товары Цикл
			
			СтрокаТЧ.НачалоДействияДоИзменений = ПустаяДата;
			СтрокаТЧ.ОкончаниеДействияДоИзменений = ПустаяДата;
			
		КонецЦикла;
		
	Иначе
		
		РеквизитыУсловий = Документы.УсловияРетроБонусовКлиентов.АктуальныеДанные(ИсправляемыйДокумент);
		Если РеквизитыУсловий.СегментыЗафиксированы
		   И РазрешеноИзменение Тогда
			
			ТекстУведомления = НСтр("ru = 'Сегменты зафиксированы, ввод исправлений невозможен'");
			ОбщегоНазначения.СообщитьПользователю(ТекстУведомления, ЭтотОбъект,,, Отказ);
			
		КонецЕсли;
		
	КонецЕсли;
	
	ПроверитьОграниченияПоНачислениям(РеквизитыВида, Отказ, Истина);
	
	ИсправлениеДокументов.ПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения);
	ПроведениеДокументов.ПередЗаписьюДокумента(ЭтотОбъект, РежимЗаписи, РежимПроведения);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ПроведениеДокументов.ПриЗаписиДокумента(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ПроведениеДокументов.ОбработкаПроведенияДокумента(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	ПроведениеДокументов.ОбработкаУдаленияПроведенияДокумента(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ИсправлениеДокументов.ПриКопировании(ЭтотОбъект, ОбъектКопирования);
	
	Статус = Перечисления.СтатусыДокументовРетроБонусов.Черновик;
	
	СтруктураОтбора = Новый Структура();
	СтруктураОтбора.Вставить("Отменено", Ложь);
	
	ИнициализироватьКопируемыйСписок("Контрагенты");
	ИнициализироватьКопируемыйСписок("ИННКонтрагентов");
	ИнициализироватьКопируемыйСписок("СегментыПартнеров");
	
	ИнициализироватьКопируемыйСписок("Товары");
	ИнициализироватьКопируемыйСписок("СегментыТоваров");
	
	ИнициализироватьДокумент();
	
КонецПроцедуры

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	
	Префикс = ?(Исправление, "К", "0");
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Данные вида документа.
// 
// Возвращаемое значение:
//  Структура:
//	* БезРасчета - Булево
//	* НачалоДействия - Дата
//	* ОкончаниеДействия - Дата 
//	* ПериодичностьУсловий - ПеречислениеСсылка.ПериодичностиРетроБонусов
//	* ПериодичностьНачислений - ПеречислениеСсылка.ПериодичностиРетроБонусов
//	* ДетализацияРасчетаУчастников - ПеречислениеСсылка.ДетализацияРасчетаУчастниковРетроБонусов
//	* ОтборТоваров - ПеречислениеСсылка.СоставыСписковРетроБонусов
//	* ОтборУчастников - ПеречислениеСсылка.СоставыСписковРетроБонусов
//	* ПоказательПродаж - ПеречислениеСсылка.ЦелевыеПоказателиПродажРетроБонусов
//	* БазаРасчетаПродаж - ПеречислениеСсылка.БазыРасчетаПродажРетроБонусов
//	* СоставТоваров - ПеречислениеСсылка.СоставыТоваровРетроБонусов
//	* СоставУчастников - ПеречислениеСсылка.СоставыУчастниковРетроБонусов
//
Функция ДанныеВидаДокумента()
	
	МассивРеквизитов = Новый Массив; // Массив Из Строка
	МассивРеквизитов.Добавить("НачалоДействия");
	МассивРеквизитов.Добавить("ОкончаниеДействия");
	МассивРеквизитов.Добавить("ПериодичностьУсловий");
	МассивРеквизитов.Добавить("ПериодичностьНачислений");
	МассивРеквизитов.Добавить("ДетализацияРасчетаУчастников");
	МассивРеквизитов.Добавить("ОтборТоваров");
	МассивРеквизитов.Добавить("ОтборУчастников");
	МассивРеквизитов.Добавить("БезРасчета");
	МассивРеквизитов.Добавить("ПоказательПродаж");
	МассивРеквизитов.Добавить("БазаРасчетаПродаж");
	МассивРеквизитов.Добавить("СоставТоваров");
	МассивРеквизитов.Добавить("СоставУчастников");
	РеквизитыВида = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ВидРетроБонуса, МассивРеквизитов);
	
	Возврат РеквизитыВида;
	
КонецФункции

// Заполнить по условию ретро бонусов клиентов.
// 
// Параметры:
//  ДанныеЗаполнения - ДокументСсылка.УсловияРетроБонусовКлиентов - Данные заполнения
//
Процедура ЗаполнитьПоУсловиюРетроБонусовКлиентов(ДанныеЗаполнения)
	
	ДокументЗаполнения = ДанныеЗаполнения; // ДокументСсылка.УсловияРетроБонусовКлиентов
	ПоследнееИсправление = ИсправлениеДокументов.ПоследнийИсправительныйДокумент(ДокументЗаполнения);
	
	ИменаРеквизитов = Новый Структура;
	ИменаРеквизитов.Вставить("НачалоДействия");
	ИменаРеквизитов.Вставить("ОкончаниеДействия");
	ИменаРеквизитов.Вставить("СуммаПлан");
	ИменаРеквизитов.Вставить("ПоказательПродаж", "ВидРетроБонуса.ПоказательПродаж");
	ИменаРеквизитов.Вставить("СоставУчастников", "ВидРетроБонуса.СоставУчастников");
	
	Если ПоследнееИсправление = Неопределено Тогда
		
		ИсправлениеДокументов.ЗаполнитьИсправление(ЭтотОбъект, ДокументЗаполнения);
		РеквизитыОснования = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументЗаполнения, ИменаРеквизитов);
		
	Иначе
		
		ПоследнееИсправлениеСсылка = ПоследнееИсправление.Ссылка; // ДокументСсылка.УсловияРетроБонусовКлиентов
		
		ПоследнееИсправлениеСтатус = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
			ПоследнееИсправлениеСсылка, "Статус");
		Если ПоследнееИсправлениеСтатус <> Перечисления.СтатусыДокументовРетроБонусов.Согласован Тогда
			
			ТекстУведомления = НСтр("ru = 'Последний в цепочке исправлений документ не согласован, ввод исправлений невозможен'");
			ВызватьИсключение ТекстУведомления;
			
		КонецЕсли;
		
		ИсправлениеДокументов.ЗаполнитьИсправление(ЭтотОбъект, ПоследнееИсправление.Ссылка);
		РеквизитыОснования = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПоследнееИсправление.Ссылка, ИменаРеквизитов);
		
	КонецЕсли;
	
	Если ПериодичностьНачислений = Перечисления.ПериодичностиРетроБонусов.Однократно Тогда
		
		МаксимальнаяДата = РетроБонусыСервер.ГраницаНачисленийКлиентов(ИсправляемыйДокумент);
		Если МаксимальнаяДата <> Дата(1, 1, 1) Тогда
			
			ТекстУведомления = НСтр("ru = 'Зарегистрировано начисление ретро-бонусов, ввод исправлений невозможен'");
			ВызватьИсключение ТекстУведомления;
			
		КонецЕсли;
		
	КонецЕсли;
	
	РеквизитыУсловий = Документы.УсловияРетроБонусовКлиентов.АктуальныеДанные(ИсправляемыйДокумент);
	Если РеквизитыУсловий.СегментыЗафиксированы Тогда
		
		ТекстУведомления = НСтр("ru = 'Сегменты зафиксированы, ввод исправлений невозможен'");
		ВызватьИсключение ТекстУведомления;
		
	КонецЕсли;
	
	Статус = Перечисления.СтатусыДокументовРетроБонусов.Черновик;
	
	ДетализацияРасчета = Перечисления.ДетализацияРасчетаУчастниковРетроБонусов;
	
	ДетализацияКонтрагентСоставКлиент =
		(ДетализацияРасчетаУчастников = ДетализацияРасчета.ПоКонтрагенту
		 И РеквизитыОснования.СоставУчастников = Перечисления.СоставыУчастниковРетроБонусов.Клиенты);
	
	ДетализацияКлиентСоставКонтрагент =
		(ДетализацияРасчетаУчастников = ДетализацияРасчета.ПоКлиенту
		 И РеквизитыОснования.СоставУчастников = Перечисления.СоставыУчастниковРетроБонусов.Контрагенты);
	
	ПланУказывается = НЕ (ОтборУчастников = Перечисления.СоставыСписковРетроБонусов.Выбранные
						  И (ДетализацияКонтрагентСоставКлиент
							 ИЛИ ДетализацияКлиентСоставКонтрагент));
	
	ЗаполнятьПлан = (ОтборУчастников <> Перечисления.СоставыСписковРетроБонусов.КромеВыбранных
					 И ПланУказывается);
	
	#Область ТЧ_Контрагенты
	СтрокиКУдалению = Новый Массив; // Массив из СтрокаТабличнойЧасти: см. Документ.УсловияРетроБонусовКлиентов.Контрагенты
	
	Для Каждого СтрокаТЧ Из Контрагенты Цикл
		
		Если СтрокаТЧ.Отменено Тогда
			
			СтрокиКУдалению.Добавить(СтрокаТЧ);
			Продолжить;
			
		КонецЕсли;
		
		СтрокаТЧ.ИсходнаяСтрока = Истина;
		СтрокаТЧ.ПланНеУказываетсяДоИзменений = СтрокаТЧ.ПланНеУказывается;
		Если ЗаполнятьПлан Тогда
			
			Если СтрокаТЧ.СуммаПлан = 0 Тогда
				
				СтрокаТЧ.СуммаПланДоИзменений = РеквизитыОснования.СуммаПлан;
				
			Иначе
				
				СтрокаТЧ.СуммаПланДоИзменений = СтрокаТЧ.СуммаПлан;
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если ОтборУчастников = Перечисления.СоставыСписковРетроБонусов.Выбранные Тогда
			
			ЗаполнитьДанныеПериодовПоОснованию(СтрокаТЧ, РеквизитыОснования);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого СтрокаКУдалению Из СтрокиКУдалению Цикл
		
		Контрагенты.Удалить(СтрокаКУдалению);
		
	КонецЦикла;
	#КонецОбласти
	
	#Область ТЧ_ИННКонтрагентов
	СтрокиКУдалению = Новый Массив; // Массив из СтрокаТабличнойЧасти: см. Документ.УсловияРетроБонусовКлиентов.ИННКонтрагентов
	
	Для Каждого СтрокаТЧ Из ИННКонтрагентов Цикл
		
		Если СтрокаТЧ.Отменено Тогда
			
			СтрокиКУдалению.Добавить(СтрокаТЧ);
			Продолжить;
			
		КонецЕсли;
		
		СтрокаТЧ.ИсходнаяСтрока = Истина;
		Если ЗаполнятьПлан Тогда
			
			Если СтрокаТЧ.СуммаПлан = 0 Тогда
				
				СтрокаТЧ.СуммаПланДоИзменений = РеквизитыОснования.СуммаПлан;
				
			Иначе
				
				СтрокаТЧ.СуммаПланДоИзменений = СтрокаТЧ.СуммаПлан;
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если ОтборУчастников = Перечисления.СоставыСписковРетроБонусов.Выбранные Тогда
			
			ЗаполнитьДанныеПериодовПоОснованию(СтрокаТЧ, РеквизитыОснования);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого СтрокаКУдалению Из СтрокиКУдалению Цикл
		
		ИННКонтрагентов.Удалить(СтрокаКУдалению);
		
	КонецЦикла;
	#КонецОбласти
	
	#Область ТЧ_Товары
	СтрокиКУдалению = Новый Массив; // Массив из СтрокаТабличнойЧасти: см. Документ.УсловияРетроБонусовКлиентов.Товары
	
	Для Каждого СтрокаТЧ Из Товары Цикл
		
		Если СтрокаТЧ.Отменено Тогда
			
			СтрокиКУдалению.Добавить(СтрокаТЧ);
			Продолжить;
			
		КонецЕсли;
		
		СтрокаТЧ.ИсходнаяСтрока = Истина;
		
		Если РетроБонусыКлиентСервер.ИспользуетсяПериодУсловийТоваров(РеквизитыОснования.ПоказательПродаж) Тогда
			
			ЗаполнитьДанныеПериодовПоОснованию(СтрокаТЧ, РеквизитыОснования);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого СтрокаКУдалению Из СтрокиКУдалению Цикл
		
		Товары.Удалить(СтрокаКУдалению);
		
	КонецЦикла;
	#КонецОбласти
	
	#Область ТЧ_СегментыПартнеров
	СтрокиКУдалению = Новый Массив; // Массив из СтрокаТабличнойЧасти: см. Документ.УсловияРетроБонусовКлиентов.СегментыПартнеров
	
	Для Каждого СтрокаТЧ Из СегментыПартнеров Цикл
		
		Если СтрокаТЧ.Отменено Тогда
			
			СтрокиКУдалению.Добавить(СтрокаТЧ);
			Продолжить;
			
		КонецЕсли;
		
		СтрокаТЧ.ИсходнаяСтрока = Истина;
		
	КонецЦикла;
	
	Для Каждого СтрокаКУдалению Из СтрокиКУдалению Цикл
		
		СегментыПартнеров.Удалить(СтрокаКУдалению);
		
	КонецЦикла;
	#КонецОбласти
	
	#Область ТЧ_СегментыТоваров
	СтрокиКУдалению = Новый Массив; // Массив из СтрокаТабличнойЧасти: см. Документ.УсловияРетроБонусовКлиентов.СегментыТоваров
	
	Для Каждого СтрокаТЧ Из СегментыТоваров Цикл
		
		Если СтрокаТЧ.Отменено Тогда
			
			СтрокиКУдалению.Добавить(СтрокаТЧ);
			Продолжить;
			
		КонецЕсли;
		
		СтрокаТЧ.ИсходнаяСтрока = Истина;
		
	КонецЦикла;
	
	Для Каждого СтрокаКУдалению Из СтрокиКУдалению Цикл
		
		СегментыТоваров.Удалить(СтрокаКУдалению);
		
	КонецЦикла;
	#КонецОбласти
	
КонецПроцедуры

// Параметры:
//  СтрокаДанных - СтрокаТабличнойЧасти:
//  * НачалоДействия - Дата
//  * НачалоДействияДоИзменений - Дата
//  * ОкончаниеДействия - Дата
//  * ОкончаниеДействияДоИзменений - Дата
//	ДанныеОснования - Структура:
//  * НачалоДействия - Дата
//  * ОкончаниеДействия - Дата
//
Процедура ЗаполнитьДанныеПериодовПоОснованию(СтрокаДанных, Знач ДанныеОснования)
	
	ПустаяДата = Дата(1, 1, 1);
	
	Если СтрокаДанных.НачалоДействия = ПустаяДата Тогда
				
		СтрокаДанных.НачалоДействияДоИзменений = ДанныеОснования.НачалоДействия;
		
	Иначе
		
		СтрокаДанных.НачалоДействияДоИзменений = СтрокаДанных.НачалоДействия;
		
	КонецЕсли;
	
	Если СтрокаДанных.ОкончаниеДействия = ПустаяДата Тогда
		
		СтрокаДанных.ОкончаниеДействияДоИзменений = ДанныеОснования.ОкончаниеДействия;
		
	Иначе
		
		СтрокаДанных.ОкончаниеДействияДоИзменений = СтрокаДанных.ОкончаниеДействия;
		
	КонецЕсли;
	
КонецПроцедуры

// Параметры:
//  РеквизитыВида - см. ДанныеВидаДокумента
//  Отказ - Булево - Отказ
//
Процедура ПроверитьЗаполнениеПериодовШапки(РеквизитыВида, Отказ)
	
	ПустаяДата = Дата(1, 1, 1);
	МаксимальнаяДата = Дата(2999, 12, 31);
	
	НачалоДействияВида = РеквизитыВида.НачалоДействия;
	ОкончаниеДействияВида = РеквизитыВида.ОкончаниеДействия;
	Если ОкончаниеДействияВида = ПустаяДата Тогда
		ОкончаниеДействияВида = МаксимальнаяДата;
	КонецЕсли;
	
	Если НачалоДействия <> ПустаяДата
	   И НачалоДействия < НачалоДействияВида Тогда
		
		ТекстСообщения = НСтр("ru = 'Начало периода действия документа раньше, чем начало действия вида ретро-бонуса'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, "НачалоДействия",, Отказ);
		
	КонецЕсли;
	
	Если ОкончаниеДействия <> ПустаяДата
	   И ОкончаниеДействия > ОкончаниеДействияВида Тогда
		
		ТекстСообщения = НСтр("ru = 'Окончание периода действия документа больше, чем окончание действия вида ретро-бонуса'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, "ОкончаниеДействия",, Отказ);
		
	КонецЕсли;
	
	Если НачалоДействия <> ПустаяДата
	   И ОкончаниеДействия <> ПустаяДата Тогда
		
		РезультатПроверки = РетроБонусыСервер.ПроверитьПериодыПоПериодичности(
			ПериодичностьУсловий, 
			НачалоДействия,
			ОкончаниеДействия);
		Если РезультатПроверки.ЕстьНарушениеНачала Тогда
			
			ОбщегоНазначения.СообщитьПользователю(
				РезультатПроверки.ТекстОшибкиНачала, ЭтотОбъект, "НачалоДействия",, Отказ);
			
		КонецЕсли;
		
		Если РезультатПроверки.ЕстьНарушениеОкончания Тогда
			
			ОбщегоНазначения.СообщитьПользователю(
				РезультатПроверки.ТекстОшибкиОкончания, ЭтотОбъект, "ОкончаниеДействия",, Отказ);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Проверить периоды таблицы.
// 
// Параметры:
//  ИмяТаблицы - Строка - Имя проверяемой табличной части
//  ПредставлениеТаблицы - Строка - Представление проверяемой табличной части
//  Отказ - Булево - Отказ
//
Процедура ПроверитьПериодыТаблицы(Знач ИмяТаблицы, Знач ПредставлениеТаблицы, Отказ)
	
	ПустаяДата = Дата(1, 1, 1);
	
	Если НачалоДействия = ПустаяДата
	   И ОкончаниеДействия = ПустаяДата Тогда
		Возврат;
	КонецЕсли;
	
	ШаблонСообщения = НСтр("ru = 'В строке %1 списка %2 указана %3, не соответствующая периоду действия ретро-бонуса'");
	ШаблонСообщенияОшибкаПериода = НСтр("ru = 'В строке %1 списка %2 дата начала больше даты окончания'");
	
	ТабличнаяЧастьОбъекта = ЭтотОбъект[ИмяТаблицы]; // ДокументТабличнаяЧасть.УсловияРетроБонусовКлиентов.Контрагенты, ДокументТабличнаяЧасть.УсловияРетроБонусовКлиентов.ИННКонтрагентов, ДокументТабличнаяЧасть.УсловияРетроБонусовКлиентов.Товары 
	Для Каждого СтрокаТЧ Из ТабличнаяЧастьОбъекта Цикл
		
		#Область ОкончаниеБольшеНачала
		Если СтрокаТЧ.НачалоДействия <> ПустаяДата
		   И СтрокаТЧ.ОкончаниеДействия <> ПустаяДата
		   И СтрокаТЧ.НачалоДействия > СтрокаТЧ.ОкончаниеДействия Тогда
			
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				ШаблонСообщенияОшибкаПериода, Строка(СтрокаТЧ.НомерСтроки), ПредставлениеТаблицы);
			
			Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти(
				ИмяТаблицы, СтрокаТЧ.НомерСтроки, "НачалоДействия");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле,, Отказ);
			
		КонецЕсли;
		#КонецОбласти
		
		#Область НачалоВПериодеДействия
		Если НЕ СтрокаТЧ.Отменено
		   И СтрокаТЧ.НачалоДействия <> ПустаяДата
		   И НЕ (СтрокаТЧ.НачалоДействия >= НачалоДействия
				 И СтрокаТЧ.НачалоДействия <= ОкончаниеДействия) Тогда
			
			ПредставлениеПоля = НСтр("ru = 'дата начала'");
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				ШаблонСообщения,
				Формат(СтрокаТЧ.НомерСтроки, "ЧГ=;"),
				ПредставлениеТаблицы,
				ПредставлениеПоля);
				
			Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти(
				ИмяТаблицы, СтрокаТЧ.НомерСтроки, "НачалоДействия");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле,, Отказ);
			
		КонецЕсли;
		#КонецОбласти
		
		#Область ОкончаниеВПериодеДействия 
		Если НЕ СтрокаТЧ.Отменено
		   И СтрокаТЧ.ОкончаниеДействия <> ПустаяДата
		   И НЕ (СтрокаТЧ.ОкончаниеДействия >= НачалоДействия
				 И СтрокаТЧ.ОкончаниеДействия <= ОкончаниеДействия) Тогда
			
			ПредставлениеПоля = НСтр("ru = 'дата окончания'");
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				ШаблонСообщения,
				Формат(СтрокаТЧ.НомерСтроки, "ЧГ=;"),
				ПредставлениеТаблицы,
				ПредставлениеПоля);
				
			Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти(
				ИмяТаблицы, СтрокаТЧ.НомерСтроки, "ОкончаниеДействия");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле,, Отказ);
			
		КонецЕсли;
		#КонецОбласти
		
		#Область Периодичность
		РезультатПроверки = РетроБонусыСервер.ПроверитьПериодыПоПериодичности(
			ПериодичностьУсловий,
			СтрокаТЧ.НачалоДействия, 
			СтрокаТЧ.ОкончаниеДействия);
		
		Если РезультатПроверки.ЕстьНарушениеНачала Тогда
			
			ТекстОшибки = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(
				"Колонка",
				"Корректность",
				НСтр("ru = 'Начало действия'"),
				Формат(СтрокаТЧ.НомерСтроки, "ЧГ=;"),
				ПредставлениеТаблицы,
				РезультатПроверки.ТекстОшибкиНачала);
			
			ПутьКПолю = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти(
				ИмяТаблицы, СтрокаТЧ.НомерСтроки, "НачалоДействия");
			
			ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, ЭтотОбъект, ПутьКПолю,, Отказ);
			
		КонецЕсли;
		
		Если РезультатПроверки.ЕстьНарушениеОкончания Тогда
			
			ТекстОшибки = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(
				"Колонка",
				"Корректность",
				НСтр("ru = 'Окончание действия'"),
				Формат(СтрокаТЧ.НомерСтроки, "ЧГ=;"),
				ПредставлениеТаблицы,
				РезультатПроверки.ТекстОшибкиОкончания);
			
			ПутьКПолю = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти(
				ИмяТаблицы, СтрокаТЧ.НомерСтроки, "ОкончаниеДействия");
			
			ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, ЭтотОбъект, ПутьКПолю,, Отказ);
			
		КонецЕсли;
		#КонецОбласти
		
	КонецЦикла;
	
КонецПроцедуры

// Параметры:
//  РеквизитыВида - см. ДанныеВидаДокумента
//  МассивНепроверяемыхРеквизитов - Массив из Строка- Массив непроверяемых реквизитов
//  Отказ - Булево - Отказ
//
Процедура ПроверитьПоСоставуУчастниковКонтрагенты(РеквизитыВида, МассивНепроверяемыхРеквизитов, Отказ)
	
	Если РеквизитыВида.СоставУчастников <> Перечисления.СоставыУчастниковРетроБонусов.Контрагенты
	 ИЛИ ОтборУчастников = Перечисления.СоставыСписковРетроБонусов.Все Тогда
		Возврат;
	КонецЕсли;
	
	Если ОтборУчастников = Перечисления.СоставыСписковРетроБонусов.Выбранные Тогда
		
		ПредставлениеТаблицы = НСтр("ru = 'Выбранные контрагенты'");
		ПроверитьПериодыТаблицы("Контрагенты", ПредставлениеТаблицы, Отказ);
		
	Иначе
		
		Если ОтборУчастников = Перечисления.СоставыСписковРетроБонусов.КромеВыбранных Тогда
			
			ПредставлениеТаблицы = НСтр("ru = 'Кроме контрагентов'");
			
			ПроверитьУказаниеПустыхЗначенийУчастников(Истина, Отказ, ПредставлениеТаблицы);
			
		КонецЕсли;
		
	КонецЕсли;
	
	ОтборСтрок = Новый Структура;
	ОтборСтрок.Вставить("Отменено", Ложь);
	РетроБонусыСервер.ПроверитьНаличиеДублейСтрокТЧ(
		ЭтотОбъект, "Контрагенты", "Контрагент,Партнер", Отказ, ПредставлениеТаблицы,, ОтборСтрок);
	
	ПроверитьНаличиеДействующихСтрок("Контрагенты", ПредставлениеТаблицы, Отказ);
	
	Если НЕ НачислитьСразу Тогда
		МассивНепроверяемыхРеквизитов.Добавить("Контрагенты.Партнер");
	КонецЕсли;
	МассивНепроверяемыхРеквизитов.Добавить("ИННКонтрагентов");
	МассивНепроверяемыхРеквизитов.Добавить("СегментыПартнеров");
	
КонецПроцедуры

// Параметры:
//  РеквизитыВида - см. ДанныеВидаДокумента
//  МассивНепроверяемыхРеквизитов - Массив из Строка- Массив непроверяемых реквизитов
//  Отказ - Булево - Отказ
//
Процедура ПроверитьПоСоставуУчастниковПартнеры(РеквизитыВида, МассивНепроверяемыхРеквизитов, Отказ)
	
	Если РеквизитыВида.СоставУчастников <> Перечисления.СоставыУчастниковРетроБонусов.Клиенты
	 ИЛИ ОтборУчастников = Перечисления.СоставыСписковРетроБонусов.Все Тогда
		Возврат;
	КонецЕсли;
	
	Если ОтборУчастников = Перечисления.СоставыСписковРетроБонусов.Выбранные Тогда
		
		ПредставлениеТаблицы = НСтр("ru = 'Выбранные клиенты'");
		ПроверитьПериодыТаблицы("Контрагенты", ПредставлениеТаблицы, Отказ);
		
	Иначе
		
		Если ОтборУчастников = Перечисления.СоставыСписковРетроБонусов.КромеВыбранных Тогда
			
			ПредставлениеТаблицы = НСтр("ru = 'Кроме клиентов'");
			
			ПроверитьУказаниеПустыхЗначенийУчастников(Ложь, Отказ, ПредставлениеТаблицы);
			
		КонецЕсли;
		
	КонецЕсли;
	
	ОтборСтрок = Новый Структура;
	ОтборСтрок.Вставить("Отменено", Ложь);
	РетроБонусыСервер.ПроверитьНаличиеДублейСтрокТЧ(
		ЭтотОбъект, "Контрагенты", "Партнер,Контрагент", Отказ, ПредставлениеТаблицы,, ОтборСтрок);
	
	ПроверитьНаличиеДействующихСтрок("Контрагенты", ПредставлениеТаблицы, Отказ);
	
	Если НЕ НачислитьСразу Тогда
		МассивНепроверяемыхРеквизитов.Добавить("Контрагенты.Контрагент");
	КонецЕсли;
	МассивНепроверяемыхРеквизитов.Добавить("ИННКонтрагентов");
	МассивНепроверяемыхРеквизитов.Добавить("СегментыПартнеров");
	
КонецПроцедуры

Процедура ПроверитьУказаниеПустыхЗначенийУчастников(ПроверкаПартнера, Отказ, ПредставлениеТаблицы)
	
	Если ПроверкаПартнера Тогда
		
		КлючевоеПоле = "Контрагент";
		ПредставлениеКлючевогоПоля = НСтр("ru = 'Контрагент'");
		ВспомогательноеПоле = "Партнер";
		ПредставлениеВспомогательногоПоля = НСтр("ru = 'Клиент'");
		ПустоеВспомогательноеПоле = Справочники.Партнеры.ПустаяСсылка(); // СправочникСсылка.Партнеры, СправочникСсылка.Контрагенты
		
	Иначе
		
		КлючевоеПоле = "Партнер";
		ПредставлениеКлючевогоПоля = НСтр("ru = 'Клиент'");
		ВспомогательноеПоле = "Контрагент";
		ПредставлениеВспомогательногоПоля = НСтр("ru = 'Контрагент'");
		ПустоеВспомогательноеПоле = Справочники.Контрагенты.ПустаяСсылка();
		
	КонецЕсли;
	
	Выборка = ВыборкаПустыхИЗаполненныхУчастников(КлючевоеПоле, ВспомогательноеПоле, ПустоеВспомогательноеПоле);
	
	Если ОтборУчастников = Перечисления.СоставыСписковРетроБонусов.КромеВыбранных Тогда
		
		ШаблонСообщения = НСтр("ru = 'В списке ""%1"" по ключевому полю ""%2"" (%3) в разных строках одновременно указано и не указано значение в поле ""%4""'");
		
	Иначе
		
		ШаблонСообщения = НСтр("ru = 'В списке ""%1"" по ключевому полю ""%2"" (%3) в разных строках для поля ""%4"" одновременно не указано значение и указано'");
		
	КонецЕсли;
	
	Пока Выборка.Следующий() Цикл
		
		Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти(
			"Контрагенты", Выборка.НомерСтроки, "НомерСтроки");
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			ШаблонСообщения,
			ПредставлениеТаблицы,
			ПредставлениеКлючевогоПоля,
			Строка(Выборка.КлючевоеПоле),
			ПредставлениеВспомогательногоПоля);
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, ЭтотОбъект, Поле,, Отказ);
		
	КонецЦикла;
	
КонецПроцедуры

// Параметры:
//  КлючевоеПоле - Строка - Ключевое поле
//  ВспомогательноеПоле - Строка - Вспомогательное поле
//  ПустоеВспомогательноеПоле - СправочникСсылка.Контрагенты, СправочникСсылка.Партнеры - Пустая ссылка типа
// 
// Возвращаемое значение:
//  ВыборкаИзРезультатаЗапроса:
//	* НомерСтроки - Число -
//	* КлючевоеПоле - СправочникСсылка.Партнеры, СправочникСсылка.Контрагенты -
//
Функция ВыборкаПустыхИЗаполненныхУчастников(КлючевоеПоле, ВспомогательноеПоле, ПустоеВспомогательноеПоле)
	
	Запрос = Новый Запрос;
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ТаблицаПроверки.НомерСтроки КАК НомерСтроки,
	|	ТаблицаПроверки.Партнер КАК Партнер,
	|	ТаблицаПроверки.Контрагент КАК Контрагент
	|ПОМЕСТИТЬ ТаблицаПроверки
	|ИЗ
	|	&ТаблицаПроверки КАК ТаблицаПроверки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МИНИМУМ(ТаблицаПроверки.НомерСтроки) КАК НомерСтроки,
	|	&КлючевоеПоле КАК КлючевоеПоле
	|ИЗ
	|	ТаблицаПроверки КАК ТаблицаПроверки
	|
	|СГРУППИРОВАТЬ ПО
	|	&КлючевоеПоле
	|
	|ИМЕЮЩИЕ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВЫБОР
	|		КОГДА &ВспомогательноеПоле = &ПустоеВспомогательноеПоле
	|			ТОГДА 0
	|		ИНАЧЕ 1
	|	КОНЕЦ) > 1";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&КлючевоеПоле", КлючевоеПоле);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ВспомогательноеПоле", ВспомогательноеПоле);
	Запрос.Текст = ТекстЗапроса;
	
	Запрос.УстановитьПараметр("ПустоеВспомогательноеПоле", ПустоеВспомогательноеПоле);
	
	ОтборСтрок = Новый Структура;
	ОтборСтрок.Вставить("Отменено", Ложь);
	ТаблицаПроверки = Контрагенты.Выгрузить(ОтборСтрок, "НомерСтроки, Контрагент, Партнер");
	Запрос.УстановитьПараметр("ТаблицаПроверки", ТаблицаПроверки);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Возврат Выборка;
	
КонецФункции

// Параметры:
//  РеквизитыВида - см. ДанныеВидаДокумента
//  МассивНепроверяемыхРеквизитов - Массив из Строка- Массив непроверяемых реквизитов
//  Отказ - Булево - Отказ
//
Процедура ПроверитьПоСоставуУчастниковИНН(РеквизитыВида, МассивНепроверяемыхРеквизитов, Отказ)
	
	Если РеквизитыВида.СоставУчастников <> Перечисления.СоставыУчастниковРетроБонусов.ИНН
	 ИЛИ ОтборУчастников = Перечисления.СоставыСписковРетроБонусов.Все Тогда
		Возврат;
	КонецЕсли;
			
	Если ОтборУчастников = Перечисления.СоставыСписковРетроБонусов.Выбранные Тогда
				
		ПредставлениеТаблицы = НСтр("ru = 'Выбранные ИНН'");
		ПроверитьПериодыТаблицы("ИННКонтрагентов", ПредставлениеТаблицы, Отказ);
		
	Иначе
		
		Если ОтборУчастников = Перечисления.СоставыСписковРетроБонусов.КромеВыбранных Тогда
			
			ПредставлениеТаблицы = НСтр("ru = 'Кроме ИНН'");
			
		КонецЕсли;
		
	КонецЕсли;
	
	ОтборСтрок = Новый Структура;
	ОтборСтрок.Вставить("Отменено", Ложь);
	РетроБонусыСервер.ПроверитьНаличиеДублейСтрокТЧ(
		ЭтотОбъект, "ИННКонтрагентов", "ИНН", Отказ, ПредставлениеТаблицы,, ОтборСтрок);
	
	ПроверитьНаличиеДействующихСтрок("ИННКонтрагентов", ПредставлениеТаблицы, Отказ);
	
	ПроверитьЗаполнениеИНН(ПредставлениеТаблицы, Отказ);
	МассивНепроверяемыхРеквизитов.Добавить("Контрагенты");
	МассивНепроверяемыхРеквизитов.Добавить("СегментыПартнеров");
			
КонецПроцедуры

Процедура ПроверитьЗаполнениеИНН(ПредставлениеТаблицы, Отказ)
	
	Для Каждого СтрокаИНН Из ИННКонтрагентов Цикл
			
		ДлинаИНН = СтрДлина(СокрЛП(СтрокаИНН.ИНН));
		ПутьКСтроке = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("ИННКонтрагентов", СтрокаИНН.НомерСтроки, "ИНН");
		
		Если ПустаяСтрока(СтрокаИНН.ИНН) Тогда
			
			// Проверка платформы будет вызвана
			Продолжить;
			
		ИначеЕсли ДлинаИНН <> 10
				И ДлинаИНН <> 12 Тогда
			
			РасшифровкаОшибки = НСтр("ru = 'ИНН должен состоять из 10 или 12 цифр'");
			ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(
				"Колонка",
				"Корректность",
				"ИНН",
				Формат(СтрокаИНН.НомерСтроки, "ЧГ=;"),
				ПредставлениеТаблицы,
				РасшифровкаОшибки);
			
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, ПутьКСтроке,, Отказ);
			
		Иначе
			
			ИННКорректный = Истина;
			ТекстПроверки = "";
			
			//++Локализация
			ИННКорректный = РегламентированныеДанныеКлиентСервер.ИННСоответствуетТребованиям(
				СтрокаИНН.ИНН, (ДлинаИНН = 10), ТекстПроверки);
			//--Локализация
			
			Если НЕ ИННКорректный Тогда
				
				ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(
				"Колонка",
				"Корректность",
				"ИНН",
				Формат(СтрокаИНН.НомерСтроки, "ЧГ=;"),
				ПредставлениеТаблицы,
				ТекстПроверки);
				
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, ПутьКСтроке,, Отказ);
				
			КонецЕсли;
			
		КонецЕсли;
			
	КонецЦикла;
	
КонецПроцедуры

// Параметры:
//  РеквизитыВида - см. ДанныеВидаДокумента
//  МассивНепроверяемыхРеквизитов - Массив из Строка- Массив непроверяемых реквизитов
//  Отказ - Булево - Отказ
//
Процедура ПроверитьПоСоставуУчастниковСегментыПартнеров(РеквизитыВида, МассивНепроверяемыхРеквизитов, Отказ)
	
	Если РеквизитыВида.СоставУчастников <> Перечисления.СоставыУчастниковРетроБонусов.СегментыПартнеров Тогда
		Возврат;
	КонецЕсли;
	
	МассивНепроверяемыхРеквизитов.Добавить("Контрагенты");
	МассивНепроверяемыхРеквизитов.Добавить("ИННКонтрагентов");
	
	Если ОтборУчастников = Перечисления.СоставыСписковРетроБонусов.КромеВыбранных Тогда
		
		ПредставлениеТаблицы = НСтр("ru = 'Кроме сегментов клиентов'");
		
	Иначе
		
		ПредставлениеТаблицы = НСтр("ru = 'Выбранные сегменты клиентов'");
		
	КонецЕсли;
	
	ПроверитьНаличиеДействующихСтрок("СегментыПартнеров", ПредставлениеТаблицы, Отказ);
	
	ОтборСтрок = Новый Структура;
	ОтборСтрок.Вставить("Отменено", Ложь);
	РетроБонусыСервер.ПроверитьНаличиеДублейСтрокТЧ(
		ЭтотОбъект, "СегментыПартнеров", "Сегмент", Отказ, ПредставлениеТаблицы,, ОтборСтрок);
	
КонецПроцедуры

// Параметры:
//  РеквизитыВида - см. ДанныеВидаДокумента
//  МассивНепроверяемыхРеквизитов - Массив из Строка- Массив непроверяемых реквизитов
//  Отказ - Булево - Отказ
//
Процедура ПроверитьПоСоставуТоваровНоменклатура(РеквизитыВида, МассивНепроверяемыхРеквизитов, Отказ)
	
	Если РеквизитыВида.СоставТоваров <> Перечисления.СоставыТоваровРетроБонусов.Номенклатура
	 ИЛИ ОтборТоваров = Перечисления.СоставыСписковРетроБонусов.Все Тогда
		Возврат;
	КонецЕсли;
	
	ПоказателиПродаж = Перечисления.ЦелевыеПоказателиПродажРетроБонусов;
	МассивНепроверяемыхРеквизитов.Добавить("СегментыТоваров");
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьХарактеристикиНоменклатуры") Тогда
		
		КлючевыеПоля = "Номенклатура,Характеристика";
		
	Иначе
		
		КлючевыеПоля = "Номенклатура";
		
	КонецЕсли;
	
	Если ОтборТоваров = Перечисления.СоставыСписковРетроБонусов.Выбранные Тогда
		
		ПериодыУсловияЗаполнены = (ЗначениеЗаполнено(НачалоДействия)
								   И ЗначениеЗаполнено(ОкончаниеДействия));
		
		ПредставлениеТаблицы = НСтр("ru = 'Выбранные товары'");
		ПроверитьПериодыТаблицы("Товары", ПредставлениеТаблицы, Отказ);
		
		Если РеквизитыВида.ПоказательПродаж = ПоказателиПродаж.КоличествоСовокупно
		 ИЛИ РеквизитыВида.ПоказательПродаж = ПоказателиПродаж.ПакетноеПредложение Тогда
				
			ОтборСтрок = Новый Структура;
			ОтборСтрок.Вставить("Отменено", Ложь);
			РетроБонусыСервер.ПроверитьНаличиеДублейСтрокТЧ(
				ЭтотОбъект, "Товары", КлючевыеПоля, Отказ, ПредставлениеТаблицы,, ОтборСтрок);
			
		КонецЕсли;
		
		Если ПериодыУсловияЗаполнены Тогда
			
			Если РеквизитыВида.ПоказательПродаж = ПоказателиПродаж.Сумма
			 ИЛИ РеквизитыВида.ПоказательПродаж = ПоказателиПродаж.НеИспользуется
			 ИЛИ РеквизитыВида.ПоказательПродаж = ПоказателиПродаж.Количество Тогда
				
				ПроверитьПериодыТоваровПоКлючам(РеквизитыВида, ПредставлениеТаблицы, Отказ);
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если РеквизитыВида.ПоказательПродаж = ПоказателиПродаж.Сумма
		  И ЗапретНачисленияСверхПлана Тогда
			
			МассивНепроверяемыхРеквизитов.Добавить("Товары.Процент");
			
		КонецЕсли;
		
	Иначе
		
		ПредставлениеТаблицы = НСтр("ru = 'Кроме товаров'");
		
		ОтборСтрок = Новый Структура;
		ОтборСтрок.Вставить("Отменено", Ложь);
		РетроБонусыСервер.ПроверитьНаличиеДублейСтрокТЧ(
			ЭтотОбъект, "Товары", КлючевыеПоля, Отказ, ПредставлениеТаблицы,, ОтборСтрок);
			
		МассивНепроверяемыхРеквизитов.Добавить("Товары.Процент");
		МассивНепроверяемыхРеквизитов.Добавить("Товары.НачалоДействия");
		МассивНепроверяемыхРеквизитов.Добавить("Товары.ОкончаниеДействия");
		
	КонецЕсли;
	
	Если (РеквизитыВида.ПоказательПродаж <> ПоказателиПродаж.Количество
		  И РеквизитыВида.ПоказательПродаж <> ПоказателиПродаж.КоличествоСовокупно
		  И РеквизитыВида.ПоказательПродаж <> ПоказателиПродаж.Количество) Тогда
		
		МассивНепроверяемыхРеквизитов.Добавить("Товары.КоличествоПлан");
		
	КонецЕсли;
	
	ПроверитьНаличиеДействующихСтрок("Товары", ПредставлениеТаблицы, Отказ);
	
КонецПроцедуры

Процедура ПроверитьПериодыТоваровПоКлючам(РеквизитыВида, ПредставлениеТаблицы, Отказ)
	
	Данные = ДанныеПериодовТоваровПоКлючам(РеквизитыВида);
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьХарактеристикиНоменклатуры") Тогда
		
		ШаблонСообщенияПериоды = НСтр("ru = 'В списке ""%1"" пересекаются периоды действия по ключевым полям ""Номенклатура, Характеристика"" (%2)'");
		ШаблонСообщенияДубли = НСтр("ru = 'В списке ""%1"" дублируются показатели ""Кол-во, план и/или Бонус, %"" по ключевым полям ""Номенклатура, Характеристика"" (%2)'");
		
	Иначе
		
		ШаблонСообщенияПериоды = НСтр("ru = 'В списке ""%1"" пересекаются периоды действия по ключевому полю ""Номенклатура"" (%2)'");
		ШаблонСообщенияДубли = НСтр("ru = 'В списке ""%1"" дублируются показатели ""Кол-во, план и/или Бонус, %"" по ключевому полю ""Номенклатура"" (%2)'");
		
	КонецЕсли;
	
	Пока Данные.ПересеченияПериодов.Следующий() Цикл
		
		ПредставлениеНоменклатуры = НоменклатураКлиентСервер.ПредставлениеНоменклатуры(
			Данные.ПересеченияПериодов.Номенклатура,
			Данные.ПересеченияПериодов.Характеристика);
		
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			ШаблонСообщенияПериоды,
			ПредставлениеТаблицы,
			ПредставлениеНоменклатуры);
			
		ПутьКПолю = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти(
			"Товары", Данные.ПересеченияПериодов.ПерваяСтрока, "НомерСтроки");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, ПутьКПолю,, Отказ);
		
	КонецЦикла;
	
	Пока Данные.ДублиПланаПроцента.Следующий() Цикл
		
		ПредставлениеНоменклатуры = НоменклатураКлиентСервер.ПредставлениеНоменклатуры(
			Данные.ДублиПланаПроцента.Номенклатура,
			Данные.ДублиПланаПроцента.Характеристика);
		
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			ШаблонСообщенияДубли,
			ПредставлениеТаблицы,
			ПредставлениеНоменклатуры);
			
		ПутьКПолю = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти(
			"Товары", Данные.ДублиПланаПроцента.ПерваяСтрока, "НомерСтроки");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, ПутьКПолю,, Отказ);
		
	КонецЦикла;
	
КонецПроцедуры

// Параметры:
//  РеквизитыВида - см. ДанныеВидаДокумента
// 
// Возвращаемое значение:
//  Структура - Данные периодов товаров по ключам:
// * ПересеченияПериодов - ВыборкаИзРезультатаЗапроса:
//	** ПерваяСтрока - Число -
// 	** Номенклатура - СправочникСсылка.Номенклатура -
// 	** Характеристика - СправочникСсылка.ХарактеристикиНоменклатуры -
// * ДублиПланаПроцента - ВыборкаИзРезультатаЗапроса:
//	** ПерваяСтрока - Число -
// 	** Номенклатура - СправочникСсылка.Номенклатура -
// 	** Характеристика - СправочникСсылка.ХарактеристикиНоменклатуры -
// 
Функция ДанныеПериодовТоваровПоКлючам(РеквизитыВида)
	
	Запрос = Новый Запрос;
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ТаблицаТоваров.НомерСтроки КАК НомерСтроки,
	|	ТаблицаТоваров.Номенклатура КАК Номенклатура,
	|	ТаблицаТоваров.Характеристика КАК Характеристика,
	|	ТаблицаТоваров.КоличествоПлан КАК КоличествоПлан,
	|	ТаблицаТоваров.Процент КАК Процент,
	|	ВЫБОР
	|		КОГДА ТаблицаТоваров.НачалоДействия = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА &НачалоДействия
	|		ИНАЧЕ ТаблицаТоваров.НачалоДействия
	|	КОНЕЦ КАК НачалоДействия,
	|	ВЫБОР
	|		КОГДА ТаблицаТоваров.ОкончаниеДействия = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА &ОкончаниеДействия
	|		ИНАЧЕ ТаблицаТоваров.ОкончаниеДействия
	|	КОНЕЦ КАК ОкончаниеДействия
	|ПОМЕСТИТЬ ТаблицаТоваров
	|ИЗ
	|	&ТаблицаТоваров КАК ТаблицаТоваров
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаТоваров.Номенклатура КАК Номенклатура,
	|	ТаблицаТоваров.Характеристика КАК Характеристика,
	|	МИНИМУМ(ТаблицаТоваров.НомерСтроки) КАК ПерваяСтрока
	|ИЗ
	|	ТаблицаТоваров КАК ТаблицаТоваров
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаТоваров КАК ТаблицаТоваровЗеркало
	|		ПО ТаблицаТоваров.НомерСтроки <> ТаблицаТоваровЗеркало.НомерСтроки
	|			И ТаблицаТоваров.Номенклатура = ТаблицаТоваровЗеркало.Номенклатура
	|			И ТаблицаТоваров.Характеристика = ТаблицаТоваровЗеркало.Характеристика
	|			И (ТаблицаТоваров.НачалоДействия МЕЖДУ ТаблицаТоваровЗеркало.НачалоДействия И ТаблицаТоваровЗеркало.ОкончаниеДействия
	|				ИЛИ ТаблицаТоваров.ОкончаниеДействия МЕЖДУ ТаблицаТоваровЗеркало.НачалоДействия И ТаблицаТоваровЗеркало.ОкончаниеДействия)
	|ГДЕ
	|	НЕ &ЭтоПрогрессивнаяШкала
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаТоваров.Номенклатура,
	|	ТаблицаТоваров.Характеристика
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаТоваров.Номенклатура,
	|	ТаблицаТоваров.Характеристика,
	|	МИНИМУМ(ТаблицаТоваров.НомерСтроки)
	|ИЗ
	|	ТаблицаТоваров КАК ТаблицаТоваров
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаТоваров КАК ТаблицаТоваровЗеркало
	|		ПО ТаблицаТоваров.НомерСтроки <> ТаблицаТоваровЗеркало.НомерСтроки
	|			И ТаблицаТоваров.Номенклатура = ТаблицаТоваровЗеркало.Номенклатура
	|			И ТаблицаТоваров.Характеристика = ТаблицаТоваровЗеркало.Характеристика
	|			И (ТаблицаТоваров.НачалоДействия МЕЖДУ ТаблицаТоваровЗеркало.НачалоДействия И ТаблицаТоваровЗеркало.ОкончаниеДействия
	|				ИЛИ ТаблицаТоваров.ОкончаниеДействия МЕЖДУ ТаблицаТоваровЗеркало.НачалоДействия И ТаблицаТоваровЗеркало.ОкончаниеДействия
	|				ИЛИ &ВесьПериод)
	|			И (ТаблицаТоваров.НачалоДействия <> ТаблицаТоваровЗеркало.НачалоДействия
	|				ИЛИ ТаблицаТоваров.ОкончаниеДействия <> ТаблицаТоваровЗеркало.ОкончаниеДействия)
	|ГДЕ
	|	&ЭтоПрогрессивнаяШкала
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаТоваров.Номенклатура,
	|	ТаблицаТоваров.Характеристика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТаблицаТоваров.Номенклатура КАК Номенклатура,
	|	ТаблицаТоваров.Характеристика КАК Характеристика,
	|	МИНИМУМ(ТаблицаТоваров.НомерСтроки) КАК ПерваяСтрока
	|ИЗ
	|	ТаблицаТоваров КАК ТаблицаТоваров
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаТоваров КАК ТаблицаТоваровЗеркало
	|		ПО ТаблицаТоваров.НомерСтроки <> ТаблицаТоваровЗеркало.НомерСтроки
	|			И ТаблицаТоваров.Номенклатура = ТаблицаТоваровЗеркало.Номенклатура
	|			И ТаблицаТоваров.Характеристика = ТаблицаТоваровЗеркало.Характеристика
	|			И (ТаблицаТоваров.НачалоДействия МЕЖДУ ТаблицаТоваровЗеркало.НачалоДействия И ТаблицаТоваровЗеркало.ОкончаниеДействия
	|				ИЛИ ТаблицаТоваров.ОкончаниеДействия МЕЖДУ ТаблицаТоваровЗеркало.НачалоДействия И ТаблицаТоваровЗеркало.ОкончаниеДействия
	|				ИЛИ &ВесьПериод)
	|			И (ТаблицаТоваров.КоличествоПлан = ТаблицаТоваровЗеркало.КоличествоПлан
	|				ИЛИ ТаблицаТоваров.Процент = ТаблицаТоваровЗеркало.Процент)
	|ГДЕ
	|	&ЭтоПрогрессивнаяШкала
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаТоваров.Номенклатура,
	|	ТаблицаТоваров.Характеристика";
	
	Запрос.Текст = ТекстЗапроса;
	
	ПараметрыОтбора = Новый Структура("Отменено", Ложь);
	КолонкиВыгрузки = "НомерСтроки, Номенклатура, Характеристика, КоличествоПлан, Процент, НачалоДействия, ОкончаниеДействия";
	ПодготовленныеТовары = Товары.Выгрузить(ПараметрыОтбора, КолонкиВыгрузки);
	Запрос.УстановитьПараметр("ТаблицаТоваров", ПодготовленныеТовары);
	
	Запрос.УстановитьПараметр("НачалоДействия", НачалоДействия);
	Запрос.УстановитьПараметр("ОкончаниеДействия", ОкончаниеДействия);
	
	ЭтоПрогрессивнаяШкала = 
		(РеквизитыВида.ПоказательПродаж = Перечисления.ЦелевыеПоказателиПродажРетроБонусов.Количество);
	Запрос.УстановитьПараметр("ЭтоПрогрессивнаяШкала", ЭтоПрогрессивнаяШкала);
	
	ВесьПериод = (ЭтоПрогрессивнаяШкала
				  И ПериодичностьУсловий = Перечисления.ПериодичностиРетроБонусов.ВесьПериод);
	Запрос.УстановитьПараметр("ВесьПериод", ВесьПериод);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет(); // РезультатЗапроса
	ВсегоРезультатов = РезультатЗапроса.ВГраница();
	
	ВыборкаПересеченийПериодов = РезультатЗапроса[ВсегоРезультатов - 1].Выбрать();
	ВыборкаДублейПланаПроцента = РезультатЗапроса[ВсегоРезультатов].Выбрать();
	
	Результат = Новый Структура;
	Результат.Вставить("ПересеченияПериодов", ВыборкаПересеченийПериодов);
	Результат.Вставить("ДублиПланаПроцента", ВыборкаДублейПланаПроцента);
	
	Возврат Результат;
	
КонецФункции

// Параметры:
//  РеквизитыВида - см. ДанныеВидаДокумента
//  МассивНепроверяемыхРеквизитов - Массив из Строка- Массив непроверяемых реквизитов
//  Отказ - Булево - Отказ
//
Процедура ПроверитьПоСоставуТоваровСегментыНоменклатуры(РеквизитыВида, МассивНепроверяемыхРеквизитов, Отказ)
	
	Если РеквизитыВида.СоставТоваров <> Перечисления.СоставыТоваровРетроБонусов.СегментыНоменклатуры Тогда
		Возврат;
	КонецЕсли;
	
	МассивНепроверяемыхРеквизитов.Добавить("Товары");
	
	Если ОтборТоваров = Перечисления.СоставыСписковРетроБонусов.КромеВыбранных Тогда
		
		ПредставлениеТаблицы = НСтр("ru = 'Кроме сегментов товаров'");
		
	Иначе
		
		ПредставлениеТаблицы = НСтр("ru = 'Выбранные сегменты товаров'");
		
	КонецЕсли;
	
	ОтборСтрок = Новый Структура;
	ОтборСтрок.Вставить("Отменено", Ложь);
	РетроБонусыСервер.ПроверитьНаличиеДублейСтрокТЧ(
		ЭтотОбъект, "СегментыТоваров", "Сегмент", Отказ, ПредставлениеТаблицы,, ОтборСтрок);
	
	ПроверитьНаличиеДействующихСтрок("СегментыТоваров", ПредставлениеТаблицы, Отказ);
	
КонецПроцедуры

Процедура ПроверитьНаличиеДействующихСтрок(ИмяТЧ, ПредставлениеТаблицы, Отказ)
	
	Если НЕ Исправление Тогда
		Возврат;
	КонецЕсли;
	
	ТабличнаяЧасть = ЭтотОбъект[ИмяТЧ]; // ТабличнаяЧасть
	
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("Отменено", Истина);
	КоличествоСтрокВсего = ТабличнаяЧасть.Количество();
	КоличествоСтрокОтменено = ТабличнаяЧасть.НайтиСтроки(СтруктураОтбора).Количество();
	
	ВсеСтрокиТЧОтменены = (КоличествоСтрокВсего = КоличествоСтрокОтменено);
	
	Если ВсеСтрокиТЧОтменены Тогда
		
		ТекстПричины = НСтр("ru = 'Все строки отменены, должна быть хотя бы одна действующая строка'");
		ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(
			"Список",
			"Корректность",
			,
			,
			ПредставлениеТаблицы,
			ТекстПричины);
		
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, ИмяТЧ,, Отказ);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ИнициализироватьДокумент()
	
	Ответственный = Пользователи.ТекущийПользователь();
	Организация = ЗначениеНастроекПовтИсп.ПолучитьОрганизациюПоУмолчанию(Организация);
	
КонецПроцедуры

Процедура ИнициализироватьКопируемыйСписок(ИмяСписка)
	
	СтрокиДляУдаления = Новый Массив; // Массив из СтрокаТабличнойЧасти
	ТабличнаяЧасть = ЭтотОбъект[ИмяСписка]; // ДокументТабличнаяЧасть.УсловияРетроБонусовКлиентов.Контрагенты, ДокументТабличнаяЧасть.УсловияРетроБонусовКлиентов.ИННКонтрагентов, ДокументТабличнаяЧасть.УсловияРетроБонусовКлиентов.Товары, ДокументТабличнаяЧасть.УсловияРетроБонусовКлиентов.СегментыПартнеров, ДокументТабличнаяЧасть.УсловияРетроБонусовКлиентов.СегментыТоваров
	
	Для Каждого СтрокаТЧ Из ТабличнаяЧасть Цикл
		
		Если СтрокаТЧ.Отменено Тогда
			СтрокиДляУдаления.Добавить(СтрокаТЧ);
		Иначе
			СтрокаТЧ.ИсходнаяСтрока = Ложь;
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого Строка Из СтрокиДляУдаления Цикл
		ТабличнаяЧасть.Удалить(Строка);
	КонецЦикла;
	
КонецПроцедуры

// Параметры:
//  РеквизитыВида - см. ДанныеВидаДокумента
//  Отказ - Булево -
//  ВыполнятьСБлокировкой - Булево -
//
Процедура ПроверитьОграниченияПоНачислениям(РеквизитыВида, Отказ, ВыполнятьСБлокировкой = Ложь)
	
	Результат = ДанныеДляПроверки();
	
	Если НЕ ЗначениеЗаполнено(Результат.ДокументПроверки) Тогда
		Возврат;
	КонецЕсли;
	
	ДокументПроверки = Результат.ДокументПроверки;
	ИзменениеСогласованногоДокумента = Результат.ИзменениеСогласованногоДокумента;
	
	Если ВыполнятьСБлокировкой Тогда
		
		Попытка
		
			Блокировка = Новый БлокировкаДанных;
			
			ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.РетроБонусыКлиентов");
			ЭлементБлокировки.УстановитьЗначение("ДокументУсловий", ДокументПроверки);
			
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Разделяемый;
			Блокировка.Заблокировать();
			
		Исключение
			
			ШаблонОшибки = НСтр("ru = 'Не удалось выполнить проверку на наличие уже введенных начислений по документу условий по причине:
								|%1'");
			ОписаниеОшибки = ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				ШаблонОшибки, 
				ОписаниеОшибки);
			
			ВызватьИсключение ТекстОшибки;
			
		КонецПопытки;
		
	КонецЕсли;
	
	МаксимальнаяДата = РетроБонусыСервер.ГраницаНачисленийКлиентов(ДокументПроверки);
	
	Если МаксимальнаяДата <> Дата(1, 1, 1) Тогда
		
		Если ИзменениеСогласованногоДокумента Тогда
			
			ТекстСообщения = НСтр("ru = 'Зарегистрировано начисление ретро-бонусов. Изменение документа запрещено.'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,, "Объект", Отказ);
			
		ИначеЕсли ПериодичностьНачислений = Перечисления.ПериодичностиРетроБонусов.Однократно Тогда
			
			ТекстСообщения = НСтр("ru = 'Зарегистрировано начисление ретро-бонусов, ввод исправлений невозможен'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
			
		Иначе
			
			МаксимальнаяДатаСтрокой = Формат(МаксимальнаяДата, "ДЛФ=D;");
			
			Если ОкончаниеДействия < МаксимальнаяДата Тогда
				
				Шаблон = НСтр("ru = 'Дата окончания действия не может быть меньше %1 - даты окончания периода зарегистрированного начисления'");
				ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					Шаблон, МаксимальнаяДатаСтрокой);
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,, "ОкончаниеДействия", "Объект", Отказ);
				
			КонецЕсли;
			
			ИмяПредставлениеТаблицы = РетроБонусыСервер.ИмяПредставлениеТаблицыПоРеквизитамУсловийКлиентов(
				РеквизитыВида.СоставУчастников, ОтборУчастников);
			
			Если ИмяПредставлениеТаблицы.ИмяТаблицы <> "" Тогда
				
				ИмяТаблицы = ИмяПредставлениеТаблицы.ИмяТаблицы;
				ПредставлениеТаблицы = ИмяПредставлениеТаблицы.ПредставлениеТаблицы;
				ПроверитьИзмененияУсловийВТаблице(
					МаксимальнаяДата,
					Истина,
					ОтборУчастников,
					ИмяТаблицы,
					ПредставлениеТаблицы,
					Отказ);
					
			КонецЕсли;
			
			ИмяПредставлениеТаблицы = РетроБонусыСервер.ИмяПредставлениеТаблицыПоРеквизитамУсловийКлиентов(
				РеквизитыВида.СоставТоваров, ОтборТоваров);
			
			Если ИмяПредставлениеТаблицы.ИмяТаблицы <> "" Тогда
				
				ИмяТаблицы = "Товары";
				ПредставлениеТаблицы = НСтр("ru = 'Выбранные товары'");
				ПроверитьИзмененияУсловийВТаблице(
					МаксимальнаяДата,
					Ложь,
					ОтборТоваров,
					ИмяТаблицы,
					ПредставлениеТаблицы,
					Отказ);
					
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Возвращает документ требующий проверки и признак изменения статуса.
// 
// Возвращаемое значение:
//  Структура - Данные для проверки:
// * ДокументПроверки - ДокументСсылка.УсловияРетроБонусовКлиентов - 
// * ИзменениеСогласованногоДокумента - Булево
// 
Функция ДанныеДляПроверки()
	
	Результат = Новый Структура;
	Результат.Вставить("ДокументПроверки", Документы.УсловияРетроБонусовКлиентов.ПустаяСсылка());
	Результат.Вставить("ИзменениеСогласованногоДокумента", Ложь);
	
	Если НЕ ИсправляемыйДокумент.Пустая() Тогда
		
		Результат.ДокументПроверки = ИсправляемыйДокумент;
		
	Иначе
		
		Если НЕ Ссылка.Пустая() Тогда
			
			СтатусСсылки = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "Статус");
			
			Если СтатусСсылки = Перечисления.СтатусыДокументовРетроБонусов.Согласован Тогда
				
				Результат.ДокументПроверки = Ссылка;
				Результат.ИзменениеСогласованногоДокумента = Истина;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Проверка корректности внесенных изменения по отношению к периоду начислений
// 
// Параметры:
//  МаксимальнаяДата - Дата
//  ПроверятьСуммуПлана - Булево
//  Отбор - ПеречислениеСсылка.СоставыСписковРетроБонусов
//  ИмяТаблицы - Строка - Имя проверяемой табличной части
//  ПредставлениеТаблицы - Строка - Представление проверяемой табличной части
//  Отказ - Булево
//
Процедура ПроверитьИзмененияУсловийВТаблице(МаксимальнаяДата, ПроверятьСуммуПлана, Отбор, ИмяТаблицы, ПредставлениеТаблицы, Отказ)
	
	Если Отбор = Перечисления.СоставыСписковРетроБонусов.Все
	 ИЛИ ОтборТоваров = Перечисления.СоставыСписковРетроБонусов.ПустаяСсылка() Тогда
		Возврат;
	КонецЕсли;
	
	ПустаяДата = Дата(1, 1, 1);
	
	ТабличнаяЧастьОбъекта = ЭтотОбъект[ИмяТаблицы]; // ДокументТабличнаяЧасть.УсловияРетроБонусовКлиентов.Контрагенты, ДокументТабличнаяЧасть.УсловияРетроБонусовКлиентов.ИННКонтрагентов, ДокументТабличнаяЧасть.УсловияРетроБонусовКлиентов.Товары 
	Для Каждого ТекущаяСтрокаТаблицы Из ТабличнаяЧастьОбъекта Цикл
		
		Если ТекущаяСтрокаТаблицы.НачалоДействия = ПустаяДата Тогда
			ТекущаяДатаНачала = НачалоДействия
		Иначе
			ТекущаяДатаНачала = ТекущаяСтрокаТаблицы.НачалоДействия;
		КонецЕсли;
		
		Если ТекущаяСтрокаТаблицы.ОкончаниеДействия = ПустаяДата Тогда
			ТекущаяДатаОкончания = ОкончаниеДействия;
		Иначе
			ТекущаяДатаОкончания = ТекущаяСтрокаТаблицы.ОкончаниеДействия;
		КонецЕсли;
		
		Если Отбор = Перечисления.СоставыСписковРетроБонусов.Выбранные Тогда
			
			ПроверитьДопустимостьНачалаПериодаСтроки(
				МаксимальнаяДата,
				ИмяТаблицы,
				ПредставлениеТаблицы,
				ТекущаяСтрокаТаблицы,
				ТекущаяДатаНачала,
				Отказ);
			
			ПроверитьДопустимостьОкончанияПериодаСтроки(
				МаксимальнаяДата,
				ИмяТаблицы,
				ПредставлениеТаблицы,
				ТекущаяДатаОкончания,
				ТекущаяСтрокаТаблицы,
				Отказ);
			
			ПроверитьИзменениеНачалоПериодаИсходнойСтроки(
				МаксимальнаяДата,
				ИмяТаблицы,
				ПредставлениеТаблицы,
				ТекущаяСтрокаТаблицы,
				ТекущаяДатаНачала,
				Отказ);
			
			ПроверитьДопустимостьНачалаПериодаИсходнойСтроки(
				МаксимальнаяДата,
				ИмяТаблицы,
				ПредставлениеТаблицы,
				ТекущаяДатаНачала,
				ТекущаяСтрокаТаблицы,
				Отказ);
			
			ПроверитьИзменениеОкончанияПериодаИсходнойСтроки(
				МаксимальнаяДата,
				ИмяТаблицы,
				ПредставлениеТаблицы,
				ТекущаяДатаОкончания,
				ТекущаяСтрокаТаблицы,
				Отказ);
			
			Если ТекущаяСтрокаТаблицы.Отменено
			   И ТекущаяСтрокаТаблицы.НачалоДействияДоИзменений <= МаксимальнаяДата
			   И ТекущаяСтрокаТаблицы.ОкончаниеДействияДоИзменений >= МаксимальнаяДата Тогда
				
				Шаблон = НСтр("ru = 'В строке %1 списка ""%2"" отмена невозможна. В период действия условия были зарегистрированы начисления'");
				ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					Шаблон,
					Строка(ТекущаяСтрокаТаблицы.НомерСтроки),
					ПредставлениеТаблицы);
				
				Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти(
					ИмяТаблицы, ТекущаяСтрокаТаблицы.НомерСтроки, "НомерСтроки");
					
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,, Поле, "Объект", Отказ);
				
			КонецЕсли;
			
			Если ПроверятьСуммуПлана Тогда
				
				Если ТекущаяСтрокаТаблицы.СуммаПлан = 0 Тогда
					СуммаПланТекущая = СуммаПлан;
				Иначе
					СуммаПланТекущая = ТекущаяСтрокаТаблицы.СуммаПлан;
				КонецЕсли;
				
				Если ТекущаяСтрокаТаблицы.ИсходнаяСтрока
				   И СуммаПланТекущая <> ТекущаяСтрокаТаблицы.СуммаПланДоИзменений
				   И ТекущаяСтрокаТаблицы.ОкончаниеДействияДоИзменений >= МаксимальнаяДата
				   И ТекущаяСтрокаТаблицы.НачалоДействияДоИзменений <= МаксимальнаяДата Тогда
					
					Шаблон = НСтр("ru = 'В строке %1 списка ""%2"" сумму плана менять запрещено. В период действия условия были зарегистрированы начисления'");
					ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
						Шаблон,
						Строка(ТекущаяСтрокаТаблицы.НомерСтроки),
						ПредставлениеТаблицы);
					
					Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти(
						ИмяТаблицы, ТекущаяСтрокаТаблицы.НомерСтроки, "СуммаПлан");
						
					ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,, Поле, "Объект", Отказ);
					
				КонецЕсли;
				
			КонецЕсли;
			
		Иначе
			
			БылиКорректировки = Ложь;
			
			Если НЕ ТекущаяСтрокаТаблицы.ИсходнаяСтрока
			 ИЛИ ТекущаяСтрокаТаблицы.Отменено
			 ИЛИ ТекущаяСтрокаТаблицы.ОкончаниеДействия <> ПустаяДата
			 ИЛИ ТекущаяСтрокаТаблицы.НачалоДействия <> ПустаяДата Тогда
				
				БылиКорректировки = Истина;
				
			КонецЕсли;
			
			Если ПроверятьСуммуПлана
			   И ТекущаяСтрокаТаблицы.СуммаПлан <> 0
			   И ТекущаяСтрокаТаблицы.СуммаПлан <> ТекущаяСтрокаТаблицы.СуммаПланДоИзменений Тогда
				
				БылиКорректировки = Истина;
				
			КонецЕсли;
			
			Если БылиКорректировки Тогда
				
				Шаблон = НСтр("ru = 'В строке %1 списка ""%2"" изменены условия. Запрещено изменять условия, так как в период действия условия были зарегистрированы начисления'");
				ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					Шаблон,
					Строка(ТекущаяСтрокаТаблицы.НомерСтроки),
					ПредставлениеТаблицы);
				Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти(
					ИмяТаблицы, ТекущаяСтрокаТаблицы.НомерСтроки, "НомерСтроки");
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,, Поле, "Объект", Отказ);
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПроверитьДопустимостьНачалаПериодаСтроки(МаксимальнаяДата, Знач ИмяТаблицы, Знач ПредставлениеТаблицы, ТекущаяСтрокаТаблицы, Знач ТекущаяДатаНачала, Отказ)
	
	Если НЕ ТекущаяСтрокаТаблицы.ИсходнаяСтрока
	   И ТекущаяДатаНачала <= МаксимальнаяДата Тогда
		
		Шаблон = НСтр("ru = 'В строке %1 списка ""%2"" дата начала не может быть меньше или равна %3 - даты окончания периода зарегистрированного начисления'");
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			Шаблон,
			Строка(ТекущаяСтрокаТаблицы.НомерСтроки),
			ПредставлениеТаблицы,
			Формат(МаксимальнаяДата, "ДЛФ=D;"));
		
		Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти(
			ИмяТаблицы, ТекущаяСтрокаТаблицы.НомерСтроки, "НачалоДействия");
		
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,, Поле, "Объект", Отказ);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьДопустимостьОкончанияПериодаСтроки(МаксимальнаяДата, Знач ИмяТаблицы, Знач ПредставлениеТаблицы, Знач ТекущаяДатаОкончания, ТекущаяСтрокаТаблицы, Отказ)
	
	Если НЕ ТекущаяСтрокаТаблицы.ИсходнаяСтрока
	   И ТекущаяДатаОкончания <= МаксимальнаяДата Тогда
		
		Шаблон = НСтр("ru = 'В строке %1 списка ""%2"" дата окончания не может быть меньше или равна %3 - даты окончания периода зарегистрированного начисления'");
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			Шаблон,
			Строка(ТекущаяСтрокаТаблицы.НомерСтроки),
			ПредставлениеТаблицы,
			Формат(МаксимальнаяДата, "ДЛФ=D;"));
		
		Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти(
			ИмяТаблицы, ТекущаяСтрокаТаблицы.НомерСтроки, "ОкончаниеДействия");
		
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,, Поле, "Объект", Отказ);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьИзменениеОкончанияПериодаИсходнойСтроки(МаксимальнаяДата, Знач ИмяТаблицы, Знач ПредставлениеТаблицы, Знач ТекущаяДатаОкончания, ТекущаяСтрокаТаблицы, Отказ)
	
	Если ТекущаяСтрокаТаблицы.ИсходнаяСтрока
	   И НЕ ТекущаяСтрокаТаблицы.Отменено
	   И ТекущаяСтрокаТаблицы.ОкончаниеДействияДоИзменений >= МаксимальнаяДата
	   И ТекущаяДатаОкончания < МаксимальнаяДата Тогда
		
		Шаблон = НСтр("ru = 'В строке %1 списка ""%2"" дата окончания не может быть меньше %3 - даты окончания периода зарегистрированного начисления'");
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			Шаблон,
			Строка(ТекущаяСтрокаТаблицы.НомерСтроки),
			ПредставлениеТаблицы,
			Формат(МаксимальнаяДата, "ДЛФ=D;"));
		Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти(
			ИмяТаблицы, ТекущаяСтрокаТаблицы.НомерСтроки, "ОкончаниеДействия");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,, Поле, "Объект", Отказ);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьДопустимостьНачалаПериодаИсходнойСтроки(Знач МаксимальнаяДата, Знач ИмяТаблицы, Знач ПредставлениеТаблицы, Знач ТекущаяДатаНачала, ТекущаяСтрокаТаблицы, Отказ)
	
	Если ТекущаяСтрокаТаблицы.ИсходнаяСтрока
	   И НЕ ТекущаяСтрокаТаблицы.Отменено
	   И ТекущаяСтрокаТаблицы.НачалоДействияДоИзменений > МаксимальнаяДата
	   И ТекущаяДатаНачала <= МаксимальнаяДата Тогда
		
		Шаблон = НСтр("ru = 'В строке %1 списка ""%2"" дата начала не может меньше или равной %3 - даты окончания периода зарегистрированного начисления'");
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			Шаблон,
			Строка(ТекущаяСтрокаТаблицы.НомерСтроки),
			ПредставлениеТаблицы,
			Формат(МаксимальнаяДата, "ДЛФ=D;"));
		
		Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти(
			ИмяТаблицы, ТекущаяСтрокаТаблицы.НомерСтроки, "НачалоДействия");
		
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,, Поле, "Объект", Отказ);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьИзменениеНачалоПериодаИсходнойСтроки(Знач МаксимальнаяДата, Знач ИмяТаблицы, Знач ПредставлениеТаблицы, ТекущаяСтрокаТаблицы, Знач ТекущаяДатаНачала, Отказ)
	
	Если ТекущаяСтрокаТаблицы.ИсходнаяСтрока
	   И НЕ ТекущаяСтрокаТаблицы.Отменено
	   И ТекущаяСтрокаТаблицы.НачалоДействияДоИзменений <= МаксимальнаяДата
	   И ТекущаяДатаНачала <> ТекущаяСтрокаТаблицы.НачалоДействияДоИзменений Тогда
		
		Шаблон = НСтр("ru = 'В строке %1 списка ""%2"" дата начала не может быть изменена, так как в период действия условия были зарегистрированы начисления'");
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			Шаблон,
			Строка(ТекущаяСтрокаТаблицы.НомерСтроки),
			ПредставлениеТаблицы);
		
		Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти(
			ИмяТаблицы, ТекущаяСтрокаТаблицы.НомерСтроки, "НачалоДействия");
		
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,, Поле, "Объект", Отказ);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьЦепочкуДокументов(РежимЗаписи)
	
	Если ИсправляемыйДокумент.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	РеквизитыИсправляемого = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
		ИсправляемыйДокумент, "ИдентификаторЦепочки");
	
	Если РеквизитыИсправляемого.ИдентификаторЦепочки <> ИдентификаторЦепочки
	   И РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		
		ТекстОшибки = НСтр("ru = 'Исправляемый документ был пересогласован, текущая корректировка запрещена к использованию.
						   |Создайте новый документ корректировки.'");
		ВызватьИсключение ТекстОшибки
		
	КонецЕсли;
	
	РеквизитыСторнируемого = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
		СторнируемыйДокумент, "Статус");
		
	Если РеквизитыСторнируемого.Статус <> Перечисления.СтатусыДокументовРетроБонусов.Согласован Тогда
		
		ТекстОшибки = НСтр("ru = 'Предыдущее исправление документ не согласовано, проведение документа запрещено.'");
		ВызватьИсключение ТекстОшибки
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли