Функция Расч(Т, Д1, Д2, К) Экспорт
    
    Врем = 0;
    Для й = 0 По Т.Количество() - 1 Цикл
        Если Т[й].д >= Д1 И Т[й].д <= Д2 Тогда
            Если К = 1 Тогда
                Врем = Врем + Т[й].с;
            ИначеЕсли К = 2 Тогда
                Врем = Врем + Т[й].с * Т[й].к;
            ИначеЕсли К = 3 Тогда
                Если Т[й].т = 1 Тогда
                    Врем = Врем + Т[й].с;
                КонецЕсли;
            КонецЕсли;
        КонецЕсли;
    КонецЦикла;
    
    Возврат Врем;
    
КонецФункции
