#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Получает реквизиты объекта, которые необходимо блокировать от изменения
//
// Возвращаемое значение:
//  Массив Из Строка - блокируемые реквизиты объекта.
//
Функция ПолучитьБлокируемыеРеквизитыОбъекта() Экспорт

	Результат = Новый Массив;
	
	Результат.Добавить("Наименование");
	Результат.Добавить("Организация");
	Результат.Добавить("Номинал");
	Результат.Добавить("ТипКарты");
	Результат.Добавить("УчетПодарочныхСертификатов2_5");
	Результат.Добавить("ПериодДействия");
	Результат.Добавить("КоличествоПериодовДействия");
	Результат.Добавить("СегментНоменклатуры;ИспользоватьСегментНоменклатуры");
	Результат.Добавить("ЧастичнаяОплата;ЧастичнаяОплатаПереключатель");
	Результат.Добавить("ШаблоныКодовПодарочныхСертификатов");
	Результат.Добавить("СчетУчета");
	Результат.Добавить("СтатьяДоходов");
	Результат.Добавить("НастройкаСчетовУчета_СчетУчета_РасчетыПоПодарочнымСертификатам");
	Результат.Добавить("АналитикаДоходов");
	Результат.Добавить("ГруппаФинансовогоУчета");
	Результат.Добавить("СтатьяДвиженияДенежныхСредствПродажа");
	Результат.Добавить("СтатьяДвиженияДенежныхСредствВозврат");
	Результат.Добавить("НаправлениеДеятельности");
	Результат.Добавить("Бессрочный");
	
	Возврат Результат;

КонецФункции

#Область ДляВызоваИзДругихПодсистем


#КонецОбласти

#КонецОбласти

#КонецЕсли