#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"ПрисоединитьДополнительныеТаблицы
	|ЭтотСписок КАК Т
	|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК Т1 
	|	ПО Т.АналитикаУчетаПоПартнерам = Т1.КлючАналитики
	|;
	|РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Т1.Организация)
	|	И ЗначениеРазрешено(Т1.Партнер)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОбновлениеИнформационнойБазы

// Добавляет в список процедуры-обработчики обновления данных ИБ
// для всех поддерживаемых версий библиотеки или конфигурации.
// Вызывается перед началом обновления данных ИБ для построения плана обновления.
//
// Параметры:
// 	Обработчики - см. ОбновлениеИнформационнойБазы.НоваяТаблицаОбработчиковОбновления
//
Процедура ПриДобавленииОбработчиковОбновления(Обработчики) Экспорт

	Обработчик = Обработчики.Добавить();
	Обработчик.Процедура = "РегистрыНакопления.РасчетыСПоставщиками.ОбработатьДанныеДляПереходаНаНовуюВерсию";
	Обработчик.Версия = "11.5.19.73";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("489f7d26-6bd5-7043-a55c-3d06d445974a");
	Обработчик.Многопоточный = Истина;
	Обработчик.ПроцедураЗаполненияДанныхОбновления = "РегистрыНакопления.РасчетыСПоставщиками.ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию";
	Обработчик.ПроцедураПроверки = "ОбновлениеИнформационнойБазы.ДанныеОбновленыНаНовуюВерсиюПрограммы";
	Обработчик.Порядок = Перечисления.ПорядокОбработчиковОбновления.Обычный;
	Обработчик.Комментарий = СтрШаблон(НСтр("ru = 'Заменяет хозяйственную операцию ""Оплата самозанятому"" на операцию ""Оплата поставщику"".
	|Очищает движения ресурса ""Оплачивается"" по Заявкам на расходование средств с пустыми объектами расчетов.
	|Перезаполняет поле ""Порядок зачета по дате платежа"" для платежных документов.
	|Исправляет порядок операции движений по ресурсу ""%1""
	|Сбрасывает реквизит ""По данным объекта расчетов источника"" в случае если в движениях документа не заполнены реквизиты приемника.
	|Исправляет остаток ресурса ""%2"" при расчетах с детализациями ""Аванс по заказам, долг по накладным"", ""Аванс по договорам, долг по накладным""
	|Исправляет хозяйственную операцию для движения документов ""Взаимозачет задолженности"".'"),
	Метаданные.РегистрыНакопления.РасчетыСПоставщиками.Ресурсы.КПоступлению.Представление(),
	Метаданные.РегистрыНакопления.РасчетыСПоставщиками.Ресурсы.КОплате.Представление());
	
	Читаемые = Новый Массив;
	Читаемые.Добавить(Метаданные.РегистрыНакопления.РасчетыСПоставщиками.ПолноеИмя());
	Читаемые.Добавить(Метаданные.Справочники.ДоговорыКонтрагентов.ПолноеИмя());
	Читаемые.Добавить(Метаданные.Документы.ВзаимозачетЗадолженности.ПолноеИмя());
	Читаемые.Добавить(Метаданные.Документы.ЗаявкаНаРасходованиеДенежныхСредств.ПолноеИмя());
	Обработчик.ЧитаемыеОбъекты = СтрСоединить(Читаемые, ",");
	
	Изменяемые = Новый Массив;
	Изменяемые.Добавить(Метаданные.РегистрыНакопления.РасчетыСПоставщиками.ПолноеИмя());
	Обработчик.ИзменяемыеОбъекты = СтрСоединить(Изменяемые, ",");
	
	Блокируемые = Новый Массив;
	Блокируемые.Добавить(Метаданные.РегистрыНакопления.РасчетыСПоставщиками.ПолноеИмя());
	Обработчик.БлокируемыеОбъекты = СтрСоединить(Блокируемые, ",");

КонецПроцедуры

// Процедура регистрации данных для обработчика обновления ОбработатьДанныеДляПереходаНаВерсию.
// 
// Параметры:
//  Параметры - см. ОбновлениеИнформационнойБазы.ОсновныеПараметрыОтметкиКОбработке
Процедура ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	ПолноеИмяРегистра  = "РегистрНакопления.РасчетыСПоставщиками";

	ПараметрыВыборки = Параметры.ПараметрыВыборки;
	ПараметрыВыборки.ПолныеИменаРегистров = ПолноеИмяРегистра;
	ПараметрыВыборки.ПоляУпорядочиванияПриРаботеПользователей.Добавить("Период УБЫВ");
	ПараметрыВыборки.ПоляУпорядочиванияПриОбработкеДанных.Добавить("Период УБЫВ");
	ПараметрыВыборки.СпособВыборки = ОбновлениеИнформационнойБазы.СпособВыборкиРегистраторыРегистра();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РасчетыСПоставщиками.Регистратор КАК Регистратор,
	|	ОбъектыРасчетов.Ссылка КАК ОбъектРасчетовНакладная
	|ПОМЕСТИТЬ ВтОбъектыРасчетов
	|ИЗ
	|	РегистрНакопления.РасчетыСПоставщиками КАК РасчетыСПоставщиками
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ОбъектыРасчетов КАК ОбъектыРасчетов
	|		ПО (РасчетыСПоставщиками.Регистратор = ОбъектыРасчетов.Объект)
	|ГДЕ
	|	РасчетыСПоставщиками.Сумма <> 0
	|	И НЕ РасчетыСПоставщиками.ЗакупкаПоЗаказу В (&ПустыеСсылкиНаЗаказы)
	|	И РасчетыСПоставщиками.ЗакупкаПоЗаказу.ПорядокРасчетов В(&ПорядкиРасчетов)
	|	И НЕ РасчетыСПоставщиками.Регистратор ССЫЛКА Документ.КорректировкаРегистров
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Регистратор,
	|	ОбъектРасчетовНакладная
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДвиженияРегистра.Регистратор КАК Регистратор
	|ИЗ
	|	РегистрНакопления.РасчетыСПоставщиками КАК ДвиженияРегистра
	|ГДЕ
	|	ДвиженияРегистра.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.УдалитьОплатаСамозанятому)
	|
	// Очистка ресурса "Оплачивается"
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Расчеты.Регистратор КАК Регистратор
	|ИЗ
	|	РегистрНакопления.РасчетыСПоставщиками КАК Расчеты
	|ГДЕ
	|	Расчеты.Оплачивается <> 0
	|	И (Расчеты.ЗаявкаНаРасходованиеДенежныхСредств В (
	|		ВЫБРАТЬ РАЗЛИЧНЫЕ
	|			ДанныеРасшифровки.Ссылка КАК Ссылка
	|		ИЗ
	|			Документ.ЗаявкаНаРасходованиеДенежныхСредств.РасшифровкаПлатежа КАК ДанныеРасшифровки
	|		ГДЕ
	|			ДанныеРасшифровки.ОбъектРасчетов <> ЗНАЧЕНИЕ(Справочник.ОбъектыРасчетов.ПустаяСсылка)
	|			И ДанныеРасшифровки.ОбъектРасчетов.Объект = Неопределено)
	|		ИЛИ НЕ Расчеты.ЗаявкаНаРасходованиеДенежныхСредств.КонтролироватьОплатуПоОбъектамРасчетов)
	|
	// Перезаполнение поля ПорядокЗачетаПоДатеПлатежа
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Расчеты.Регистратор КАК Регистратор
	|ИЗ
	|	РегистрНакопления.РасчетыСПоставщиками КАК Расчеты
	|ГДЕ
	|	Расчеты.Сумма > 0
	|	И Расчеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	И Расчеты.ДатаПлатежа <> ДАТАВРЕМЯ(1,1,1)
	|	И НАЧАЛОПЕРИОДА(Расчеты.ДатаПлатежа,ДЕНЬ) <> НАЧАЛОПЕРИОДА(Расчеты.ДатаРегистратора,ДЕНЬ)
	|	И Расчеты.ПорядокОперации = Расчеты.ПорядокЗачетаПоДатеПлатежа
	|	И Расчеты.ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПереносЗадолженностиМеждуФилиалами)
	//Исправление порядка операции "КПоступлению"
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Расчеты.Регистратор КАК Регистратор
	|ИЗ
	|	РегистрНакопления.РасчетыСПоставщиками КАК Расчеты
	|ГДЕ
	|	Расчеты.КПоступлению <> 0
	|	И НАЧАЛОПЕРИОДА(Расчеты.Период, ДЕНЬ) <> НАЧАЛОПЕРИОДА(Расчеты.ДатаРегистратора, ДЕНЬ)
	|	И ПОДСТРОКА(Расчеты.ПорядокОперации, 0, 8) <> ПОДСТРОКА(Расчеты.ПорядокЗачетаПоДатеПлатежа, 0, 8)
	|	И Расчеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	И ТИПЗНАЧЕНИЯ(Расчеты.Регистратор) В (ТИП(Документ.ЗаказПоставщику)
	
	
	|										)
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РасчетыПриемники.Регистратор КАК Регистратор
	|ИЗ
	|	РегистрНакопления.РасчетыСПоставщиками КАК РасчетыПриемники
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСПоставщиками КАК НеПустыеПриемники
	|	ПО РасчетыПриемники.Регистратор = НеПустыеПриемники.Регистратор
	|		И НеПустыеПриемники.ОбъектРасчетовПриемник <> ЗНАЧЕНИЕ(Справочник.ОбъектыРасчетов.ПустаяСсылка)
	|		И НеПустыеПриемники.АналитикаУчетаПоПартнерамПриемник <> ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаПоПартнерам.ПустаяСсылка)
	|		И НеПустыеПриемники.ВалютаПриемник <> ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)
	|		И НеПустыеПриемники.СуммаПриемник <> 0
	|ГДЕ
	|	НеПустыеПриемники.Регистратор ЕСТЬ NULL
	|	И РасчетыПриемники.ПоДаннымОбъектаРасчетовИсточника
	|	И ТИПЗНАЧЕНИЯ(РасчетыПриемники.Регистратор) <> ТИП(Документ.ВзаимозачетЗадолженности)
	// Исправление остатков К оплате
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВтОбъектыРасчетов.Регистратор КАК Регистратор
	|ИЗ
	|	ВтОбъектыРасчетов КАК ВтОбъектыРасчетов
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСПоставщиками.Обороты(
	|				,
	|				,
	|				Регистратор,
	|				ОбъектРасчетов В
	|					(ВЫБРАТЬ
	|						Т.ОбъектРасчетовНакладная
	|					ИЗ
	|						ВтОбъектыРасчетов КАК Т)) КАК РасчетыСПоставщикамиОбороты
	|		ПО (ВтОбъектыРасчетов.Регистратор = РасчетыСПоставщикамиОбороты.Регистратор)
	|			И (ВтОбъектыРасчетов.ОбъектРасчетовНакладная = РасчетыСПоставщикамиОбороты.ОбъектРасчетов)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВтОбъектыРасчетов.Регистратор
	|
	|ИМЕЮЩИЕ
	|	СУММА(ЕСТЬNULL(РасчетыСПоставщикамиОбороты.СуммаОборот, 0)) <> СУММА(ЕСТЬNULL(РасчетыСПоставщикамиОбороты.КОплатеОборот, 0))
	|
	// Исправление хозяйственной операции взаимозачета задолженности
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Расчеты.Регистратор КАК Ссылка
	|ИЗ
	|	РегистрНакопления.РасчетыСПоставщиками КАК Расчеты
	|ГДЕ
	|	Расчеты.Регистратор ССЫЛКА Документ.ВзаимозачетЗадолженности
	|		И ВЫРАЗИТЬ(Расчеты.Регистратор КАК Документ.ВзаимозачетЗадолженности).ВидОперации В (&ВидыОпераций)
	|		И Расчеты.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВзаимозачетЗадолженности)";
	
	Запрос.УстановитьПараметр("ПустыеСсылкиНаЗаказы", ОперативныеВзаиморасчетыСервер.ПустыеСсылкиНаЗаказы());
	МассивПорядковРасчетов = Новый Массив;
	МассивПорядковРасчетов.Добавить(Перечисления.ПорядокРасчетов.ПоДоговорамНакладным);
	МассивПорядковРасчетов.Добавить(Перечисления.ПорядокРасчетов.ПоЗаказамНакладным);
	Запрос.УстановитьПараметр("ПорядкиРасчетов", МассивПорядковРасчетов);
	Запрос.УстановитьПараметр("ВидыОпераций", РегистрыНакопления.РасчетыСКлиентами.ВидыОпераций());
	
	ОбновлениеИнформационнойБазы.ОтметитьРегистраторыКОбработке(
		Параметры, 
		Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Регистратор"),
		ПолноеИмяРегистра);
	
КонецПроцедуры

Процедура ОбработатьДанныеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	ПолноеИмяОбъекта = "РегистрНакопления.РасчетыСПоставщиками";

	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц();
	ПараметрыОбработки = ОбновлениеИнформационнойБазы.СоздатьВременнуюТаблицуРегистраторовРегистраДляОбработки(
		Параметры.Очередь,
		Неопределено, 
		ПолноеИмяОбъекта, 
		МенеджерВременныхТаблиц);
	
	Если НЕ ПараметрыОбработки.ЕстьДанныеДляОбработки Тогда
		Параметры.ОбработкаЗавершена = Истина;
		Возврат;
	КонецЕсли;
	Если НЕ ПараметрыОбработки.ЕстьЗаписиВоВременнойТаблице Тогда
		Параметры.ОбработкаЗавершена = Ложь;
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	СсылкиДляОбработки.Регистратор КАК Регистратор,
	|	СсылкиДляОбработки.Регистратор.Номер КАК РегистраторНомер
	|ИЗ 
	|	ВТДляОбработки КАК СсылкиДляОбработки
	|;
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РасчетыПриемники.Регистратор КАК Ссылка
	|ИЗ
	|	РегистрНакопления.РасчетыСПоставщиками КАК РасчетыПриемники
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТДляОбработки КАК СсылкиДляОбработки
	|		ПО РасчетыПриемники.Регистратор = СсылкиДляОбработки.Регистратор
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСПоставщиками КАК НеПустыеПриемники
	|	ПО РасчетыПриемники.Регистратор = НеПустыеПриемники.Регистратор
	|		И НеПустыеПриемники.ОбъектРасчетовПриемник <> ЗНАЧЕНИЕ(Справочник.ОбъектыРасчетов.ПустаяСсылка)
	|		И НеПустыеПриемники.АналитикаУчетаПоПартнерамПриемник <> ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаПоПартнерам.ПустаяСсылка)
	|		И НеПустыеПриемники.ВалютаПриемник <> ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)
	|		И НеПустыеПриемники.СуммаПриемник <> 0
	|ГДЕ
	|	НеПустыеПриемники.Регистратор ЕСТЬ NULL
	|	И РасчетыПриемники.ПоДаннымОбъектаРасчетовИсточника
	|	И ТИПЗНАЧЕНИЯ(РасчетыПриемники.Регистратор) <> ТИП(Документ.ВзаимозачетЗадолженности)
	|;
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РасчетыСПоставщиками.Регистратор КАК Регистратор,
	|	ОбъектыРасчетов.Ссылка КАК ОбъектРасчетовНакладная
	|ПОМЕСТИТЬ ВтОбъектыРасчетов
	|ИЗ
	|	РегистрНакопления.РасчетыСПоставщиками КАК РасчетыСПоставщиками
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ОбъектыРасчетов КАК ОбъектыРасчетов
	|		ПО (РасчетыСПоставщиками.Регистратор = ОбъектыРасчетов.Объект)
	|ГДЕ
	|	РасчетыСПоставщиками.Сумма <> 0
	|	И НЕ РасчетыСПоставщиками.ЗакупкаПоЗаказу В (&ПустыеСсылкиНаЗаказы)
	|	И РасчетыСПоставщиками.ЗакупкаПоЗаказу.ПорядокРасчетов В(&ПорядкиРасчетов)
	|	И НЕ РасчетыСПоставщиками.Регистратор ССЫЛКА Документ.КорректировкаРегистров
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Регистратор,
	|	ОбъектРасчетовНакладная
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВтОбъектыРасчетов.Регистратор КАК Ссылка
	|ИЗ
	|	ВтОбъектыРасчетов КАК ВтОбъектыРасчетов
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСПоставщиками.Обороты(
	|				,
	|				,
	|				Регистратор,
	|				ОбъектРасчетов В
	|					(ВЫБРАТЬ
	|						Т.ОбъектРасчетовНакладная
	|					ИЗ
	|						ВтОбъектыРасчетов КАК Т)) КАК РасчетыСПоставщикамиОбороты
	|		ПО (ВтОбъектыРасчетов.Регистратор = РасчетыСПоставщикамиОбороты.Регистратор)
	|			И (ВтОбъектыРасчетов.ОбъектРасчетовНакладная = РасчетыСПоставщикамиОбороты.ОбъектРасчетов)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВтОбъектыРасчетов.Регистратор
	|
	|ИМЕЮЩИЕ
	|	СУММА(ЕСТЬNULL(РасчетыСПоставщикамиОбороты.СуммаОборот, 0)) <> СУММА(ЕСТЬNULL(РасчетыСПоставщикамиОбороты.КОплатеОборот, 0))
	|;
	// Исправление хозяйственных операций
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Расчеты.Регистратор КАК Ссылка
	|ИЗ
	|	РегистрНакопления.РасчетыСПоставщиками КАК Расчеты
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТДляОбработки КАК СсылкиДляОбработки
	|		ПО Расчеты.Регистратор = СсылкиДляОбработки.Регистратор
	|ГДЕ
	|	ВЫРАЗИТЬ(Расчеты.Регистратор КАК Документ.ВзаимозачетЗадолженности).ВидОперации В (&ВидыОперацийПоДолгу)
	|;
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Расчеты.Регистратор КАК Ссылка
	|ИЗ
	|	РегистрНакопления.РасчетыСПоставщиками КАК Расчеты
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТДляОбработки КАК СсылкиДляОбработки
	|		ПО Расчеты.Регистратор = СсылкиДляОбработки.Регистратор
	|ГДЕ
	|	ВЫРАЗИТЬ(Расчеты.Регистратор КАК Документ.ВзаимозачетЗадолженности).ВидОперации В (&ВидыОперацийПоАвансу)
	|;
	|";
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "ВТДляОбработки", ПараметрыОбработки.ИмяВременнойТаблицы);
	Запрос.УстановитьПараметр("ПустыеСсылкиНаЗаказы", ОперативныеВзаиморасчетыСервер.ПустыеСсылкиНаЗаказы());
	МассивПорядковРасчетов = Новый Массив;
	МассивПорядковРасчетов.Добавить(Перечисления.ПорядокРасчетов.ПоДоговорамНакладным);
	МассивПорядковРасчетов.Добавить(Перечисления.ПорядокРасчетов.ПоЗаказамНакладным);
	Запрос.УстановитьПараметр("ПорядкиРасчетов", МассивПорядковРасчетов);
	Запрос.УстановитьПараметр("ВидыОперацийПоДолгу", РегистрыНакопления.РасчетыСКлиентами.ВидыОперацийПоДолгу());
	Запрос.УстановитьПараметр("ВидыОперацийПоАвансу", РегистрыНакопления.РасчетыСКлиентами.ВидыОперацийПоАвансу());
	РезультатыЗапроса = Запрос.ВыполнитьПакет();

	ОбновляемыеДанные =  РезультатыЗапроса[0].Выбрать();
	ОчисткаФлагаПоДаннымИсточника = РезультатыЗапроса[1].Выгрузить().ВыгрузитьКолонку("Ссылка");
	ИсправлениеОстатковКОплате = РезультатыЗапроса[3].Выгрузить().ВыгрузитьКолонку("Ссылка");
	ВзаимозачетПереносДолга = РезультатыЗапроса[4].Выгрузить().ВыгрузитьКолонку("Ссылка");
	ВзаимозачетПереносАванса = РезультатыЗапроса[5].Выгрузить().ВыгрузитьКолонку("Ссылка");
	
	НастройкаХозяйственнойОперации = 
		Справочники.НастройкиХозяйственныхОпераций.НайтиПоРеквизиту("ХозяйственнаяОперация", Перечисления.ХозяйственныеОперации.ОплатаПоставщику);
	НеИспользуемаяНастройкаОперации = 
		Справочники.НастройкиХозяйственныхОпераций.НайтиПоРеквизиту("ХозяйственнаяОперация", Перечисления.ХозяйственныеОперации.УдалитьОплатаСамозанятому);
	
	ДанныеЗаменыОперации = РегистрыНакопления.РасчетыСКлиентами.ДанныеЗаменыОперации();
	
	Пока ОбновляемыеДанные.Следующий() Цикл
		
		ПроблемныйРегистратор = ОбновляемыеДанные.Регистратор;
		
		НачатьТранзакцию();
		
		Попытка
			
			#Область Блокировки
			Блокировка = Новый БлокировкаДанных;
			
			ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.РасчетыСПоставщиками.НаборЗаписей");
			ЭлементБлокировки.УстановитьЗначение("Регистратор", ПроблемныйРегистратор);
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			
			Блокировка.Заблокировать();
			#КонецОбласти
			
			НаборЗаписей = СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Регистратор.Установить(ПроблемныйРегистратор);
			НаборЗаписей.Прочитать();
			
			Если ОчисткаФлагаПоДаннымИсточника.Найти(ПроблемныйРегистратор) <> Неопределено Тогда
				Для Каждого Запись Из НаборЗаписей Цикл
					Запись.ПоДаннымОбъектаРасчетовИсточника = Ложь;
				КонецЦикла;
			КонецЕсли;

			ЕстьЗаявкиНаРасходованиеДенежныхСредств = Ложь;
			Для Каждого Запись Из НаборЗаписей Цикл
				Если Запись.ВидДвижения = ВидДвиженияНакопления.Приход
					И Запись.КОплате > 0 
					И НачалоДня(Запись.Период) < НачалоДня(Запись.ДатаРегистратора)
					И НЕ ТипЗнч(ПроблемныйРегистратор) = Тип("ДокументСсылка.ВводОстатков")
					И НЕ ТипЗнч(ПроблемныйРегистратор) = Тип("ДокументСсылка.ВводОстатковВзаиморасчетов") Тогда
					Запись.Период = Запись.ДатаРегистратора;
				КонецЕсли;
				
				Если Запись.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.УдалитьОплатаСамозанятому Тогда
					
					Запись.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ОплатаПоставщику;
					
					Если ЗначениеЗаполнено(Запись.НастройкаХозяйственнойОперации)
						И Запись.НастройкаХозяйственнойОперации = НеИспользуемаяНастройкаОперации Тогда
						Запись.НастройкаХозяйственнойОперации = НастройкаХозяйственнойОперации;
					КонецЕсли;
					
				КонецЕсли;
				Если ЗначениеЗаполнено(Запись.ЗаявкаНаРасходованиеДенежныхСредств) Тогда
					ЕстьЗаявкиНаРасходованиеДенежныхСредств = Истина;
				КонецЕсли;
			КонецЦикла;
			
			//Очистка ресурса "Оплачивается"
			Если ЕстьЗаявкиНаРасходованиеДенежныхСредств Тогда
				ЗаявкиНаРасходованиеДенежныхСредств = НаборЗаписей.ВыгрузитьКолонку("ЗаявкаНаРасходованиеДенежныхСредств");
				РеквизитыЗаявок = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(ЗаявкиНаРасходованиеДенежныхСредств,"КонтролироватьОплатуПоОбъектамРасчетов");
				Для Каждого Запись Из НаборЗаписей Цикл
					Если ЗначениеЗаполнено(Запись.ЗаявкаНаРасходованиеДенежныхСредств)
						И Запись.Оплачивается <> 0 
						И НЕ РеквизитыЗаявок[Запись.ЗаявкаНаРасходованиеДенежныхСредств] Тогда
						Запись.Оплачивается = 0;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			
			//Перезаполнение поля ПорядокЗачетаПоДатеПлатежа
			ТипДокумента = ТипЗнч(Запись.Регистратор);
			Тип = ОперативныеВзаиморасчетыСервер.НомерТипа(ТипДокумента);
			Для Каждого Запись Из НаборЗаписей Цикл
				Если Запись.ВидДвижения = ВидДвиженияНакопления.Приход
					И Запись.Сумма > 0 
					И ЗначениеЗаполнено(Запись.ДатаПлатежа)
					И НачалоДня(Запись.ДатаПлатежа) <> НачалоДня(Запись.ДатаРегистратора) 
					И Запись.ПорядокОперации = Запись.ПорядокЗачетаПоДатеПлатежа 
					И Запись.ХозяйственнаяОперация <> Перечисления.ХозяйственныеОперации.ПереносЗадолженностиМеждуФилиалами Тогда
					Запись.ПорядокЗачетаПоДатеПлатежа = ОперативныеВзаиморасчетыСервер.Порядок(Запись.ДатаПлатежа, 
						ОбновляемыеДанные.РегистраторНомер, ТипДокумента, Сред(Запись.ПорядокОперации,9,1), Тип);
				КонецЕсли;
			КонецЦикла;
			#Область ИсправлениеПорядкаОперации
			Если ТипЗнч(ПроблемныйРегистратор) = Тип("ДокументСсылка.ЗаказПоставщику")
				
				Тогда
				НомерДокумента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПроблемныйРегистратор, "Номер");
				Для Каждого Запись Из НаборЗаписей Цикл
					Если Запись.КПоступлению <> 0 Тогда
						Запись.ПорядокОперации = ОперативныеВзаиморасчетыСервер.Порядок(
							Запись.ДатаРегистратора,
							НомерДокумента,
							ТипЗнч(Запись.Регистратор),
							1);
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			#КонецОбласти
			
			#Область ИсправлениеОстатоквКОплате
			
			Если ИсправлениеОстатковКОплате.Найти(ПроблемныйРегистратор) <> Неопределено Тогда
			
				ИмяРегистраРасчетов = Метаданные.РегистрыНакопления.РасчетыСПоставщиками.Имя;
				ДанныеДляПроведения = ПроведениеДокументов.ДанныеДокументаДляПроведения(ПроблемныйРегистратор, ИмяРегистраРасчетов);
				НовыеДвижения = ДанныеДляПроведения["Таблица" + ИмяРегистраРасчетов];
				ВзаиморасчетыСервер.ДобавитьЗаполнитьПорядокРасчетовСПоставщиками(НовыеДвижения, ТипЗнч(ПроблемныйРегистратор));
				
				КолонкиИзмерений = "АналитикаУчетаПоПартнерам,ОбъектРасчетов,Валюта,ВидДвижения";
				// Для контроля неизменности движений по ресурсам, кроме КОплате
				КолонкиРесурсов = "Сумма,Оплачивается,КПоступлению";
				ТаблицаДвижений = НаборЗаписей.Выгрузить();
				
				СтарыеДвижения = ТаблицаДвижений.Скопировать(,КолонкиИзмерений+","+КолонкиРесурсов);
				СтарыеДвижения.Свернуть(КолонкиИзмерений, КолонкиРесурсов);
				СтарыеДвижения.Сортировать(КолонкиИзмерений+","+КолонкиРесурсов);
				Индекс = СтарыеДвижения.Количество();
				Пока Индекс > 0 Цикл
					Индекс = Индекс - 1;
					Если СтарыеДвижения[Индекс].Сумма = 0
						И СтарыеДвижения[Индекс].Оплачивается = 0
						И СтарыеДвижения[Индекс].КПоступлению = 0 Тогда
						СтарыеДвижения.Удалить(Индекс);
					КонецЕсли;
				КонецЦикла;
				
				ИдентификаторФинЗаписиКОплате = "";
				ЕстьИзменения = Ложь;
				Индекс = ТаблицаДвижений.Количество();
				Пока Индекс > 0 Цикл
					Индекс = Индекс - 1;
					Если ТаблицаДвижений[Индекс].КОплате <> 0 Тогда
						ТаблицаДвижений[Индекс].КОплате = 0;
						Если ТаблицаДвижений[Индекс].ХозяйственнаяОперация <> Перечисления.ХозяйственныеОперации.ПереносАванса Тогда
							ИдентификаторФинЗаписиКОплате = ТаблицаДвижений[Индекс].ИдентификаторФинЗаписи;
						КонецЕсли;
						Если ТаблицаДвижений[Индекс].Сумма = 0
							И ТаблицаДвижений[Индекс].Оплачивается = 0
							И ТаблицаДвижений[Индекс].КПоступлению = 0 Тогда
							ТаблицаДвижений.Удалить(Индекс);
						КонецЕсли;
						ЕстьИзменения = Истина;
					КонецЕсли;
				КонецЦикла;
				
				Для Каждого СтрокаКОплате Из НовыеДвижения Цикл
					Если СтрокаКОплате.КОплате <> 0 Тогда
						ЕстьИзменения = Истина;
						НоваяЗапись = ТаблицаДвижений.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяЗапись, СтрокаКОплате);
						НоваяЗапись.Сумма = 0;
						НоваяЗапись.СуммаУпр = 0;
						НоваяЗапись.СуммаРегл = 0;
						НоваяЗапись.ИдентификаторФинЗаписи = "";
						НоваяЗапись.Оплачивается = 0;
						НоваяЗапись.КПоступлению = 0;
						НоваяЗапись.Регистратор = ПроблемныйРегистратор;
						НоваяЗапись.Активность = Истина;
					КонецЕсли;
				КонецЦикла;
				
				НовыеДвижения = ТаблицаДвижений.Скопировать(,КолонкиИзмерений+","+КолонкиРесурсов);
				НовыеДвижения.Свернуть(КолонкиИзмерений, КолонкиРесурсов);
				НовыеДвижения.Сортировать(КолонкиИзмерений+","+КолонкиРесурсов);
				Индекс = НовыеДвижения.Количество();
				Пока Индекс > 0 Цикл
					Индекс = Индекс - 1;
					Если НовыеДвижения[Индекс].Сумма = 0
						И НовыеДвижения[Индекс].Оплачивается = 0
						И НовыеДвижения[Индекс].КПоступлению = 0 Тогда
						НовыеДвижения.Удалить(Индекс);
					КонецЕсли;
				КонецЦикла;
				
				Если ЕстьИзменения И ТаблицыРавны(СтарыеДвижения, НовыеДвижения) Тогда
				
					ЗапросСвертки = Новый Запрос;
					ЗапросСвертки.Текст = 
					"ВЫБРАТЬ
					|	&ВсеПоля
					|ПОМЕСТИТЬ ВтДвижения
					|ИЗ
					|	&ТаблицаДвижений КАК ТаблицаДвижений
					|;
					|
					|////////////////////////////////////////////////////////////////////////////////
					|ВЫБРАТЬ
					|	&ПоляГруппировки,
					|	&ПоляРесурсов
					|ИЗ
					|	ВтДвижения КАК Т
					|СГРУППИРОВАТЬ ПО
					|	&ПоляГруппировки";
					ЗапросСвертки.УстановитьПараметр("ТаблицаДвижений", ТаблицаДвижений);
					КолонкиДляГруппировки = Новый Массив;
					ВсеКолонки = Новый Массив;
					КолонкиРесурсов = КолонкиРесурсов + ",КОплате";
					Для Каждого Колонка Из ТаблицаДвижений.Колонки Цикл
						Если СтрНайти(КолонкиРесурсов, Колонка.Имя) = 0 
							И Колонка.Имя <> "СуммаУпр"
							И Колонка.Имя <> "СуммаРегл"
							И Колонка.Имя <> "ИдентификаторФинЗаписи"
							И Колонка.Имя <> "НомерСтроки"
							И Колонка.Имя <> "МоментВремени" Тогда
							КолонкиДляГруппировки.Добавить(Колонка.Имя);
						КонецЕсли;
						Если Колонка.Имя <> "МоментВремени" Тогда
							ВсеКолонки.Добавить(Колонка.Имя);
						КонецЕсли;
					КонецЦикла;
					КолонкиДляСуммирования = СтрРазделить(КолонкиРесурсов, ",");
					Индекс = 0;
					Пока Индекс < КолонкиДляСуммирования.Количество() Цикл
						КолонкиДляСуммирования[Индекс] = СтрШаблон("СУММА(%1) КАК %1", КолонкиДляСуммирования[Индекс]);
						Индекс = Индекс + 1;
					КонецЦикла;
					КолонкиДляСуммирования.Добавить("СУММА(СуммаУпр) КАК СуммаУпр");
					КолонкиДляСуммирования.Добавить("СУММА(СуммаРегл) КАК СуммаРегл");
					КолонкиДляСуммирования.Добавить("МАКСИМУМ(ИдентификаторФинЗаписи) КАК ИдентификаторФинЗаписи");
					КолонкиДляСуммирования.Добавить("МАКСИМУМ(НомерСтроки) КАК НомерСтроки");
					ЗапросСвертки.Текст = СтрЗаменить(ЗапросСвертки.Текст, "&ПоляГруппировки", СтрСоединить(КолонкиДляГруппировки,","));
					ЗапросСвертки.Текст = СтрЗаменить(ЗапросСвертки.Текст, "&ВсеПоля", СтрСоединить(ВсеКолонки,","));
					ЗапросСвертки.Текст = СтрЗаменить(ЗапросСвертки.Текст, "&ПоляРесурсов", СтрСоединить(КолонкиДляСуммирования,","));
					
					ТаблицаДвижений = ЗапросСвертки.Выполнить().Выгрузить();
					Для Каждого СтрокаДвижения Из ТаблицаДвижений Цикл
						Если СтрокаДвижения.КОплате <> 0 
							И СтрокаДвижения.Сумма = 0
							И Не ЗначениеЗаполнено(СтрокаДвижения.ИдентификаторФинЗаписи) Тогда
							СтрокаДвижения.ИдентификаторФинЗаписи = ИдентификаторФинЗаписиКОплате;
						КонецЕсли;
					КонецЦикла;
					НаборЗаписей.Загрузить(ТаблицаДвижений);
					
				Иначе
					
					ТекстСообщения = СтрШаблон(НСтр("ru = 'При выполнении обработчика обновления регистра накопления ""%1"" 
							|по исправлению остатков ""%2""изменились итоги остальных ресурсов в движениях документа 
							|%3, обработка документа не выполнена'"),
						Метаданные.РегистрыНакопления.РасчетыСПоставщиками.Представление(),
						Метаданные.РегистрыНакопления.РасчетыСПоставщиками.Ресурсы.КОплате.Представление(),
						ПроблемныйРегистратор);
					ЗаписьЖурналаРегистрации(
						ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
						УровеньЖурналаРегистрации.Ошибка,
						Метаданные.РегистрыНакопления.РасчетыСПоставщиками, ,
						ТекстСообщения);
					
				КонецЕсли;
				
			КонецЕсли;
			
			#КонецОбласти

			#Область ИсправлениеХозяйственнойОперацииВзаимозачета
			Если ВзаимозачетПереносДолга.Найти(ПроблемныйРегистратор) <> Неопределено Тогда
				РегистрыНакопления.РасчетыСКлиентами.ЗаменитьХозяйственнуюОперацию(ДанныеЗаменыОперации, НаборЗаписей, Истина);
			ИначеЕсли ВзаимозачетПереносАванса.Найти(ПроблемныйРегистратор) <> Неопределено Тогда
				РегистрыНакопления.РасчетыСКлиентами.ЗаменитьХозяйственнуюОперацию(ДанныеЗаменыОперации, НаборЗаписей, Ложь);
			КонецЕсли;
			#КонецОбласти
			
			Если НаборЗаписей.Модифицированность() Тогда
				ОбновлениеИнформационнойБазы.ЗаписатьДанные(НаборЗаписей);
			Иначе
				ОбновлениеИнформационнойБазы.ОтметитьВыполнениеОбработки(НаборЗаписей);
			КонецЕсли;
			
			ЗафиксироватьТранзакцию();
			
		Исключение
			
			ОтменитьТранзакцию();
			ОбновлениеИнформационнойБазыУТ.СообщитьОНеудачнойОбработке(ИнформацияОбОшибке(), ПроблемныйРегистратор);
			
		КонецПопытки;
		
	КонецЦикла;
	
	Параметры.ОбработкаЗавершена = ОбновлениеИнформационнойБазы.ОбработкаДанныхЗавершена(Параметры.Очередь, ПолноеИмяОбъекта);
	
КонецПроцедуры

Функция ТаблицыРавны(Таблица1, Таблица2)
	
	МассивКолонок = Новый Массив;
	Для Каждого Колонка Из Таблица1.Колонки Цикл
		МассивКолонок.Добавить(Колонка.Имя);
	КонецЦикла;
	
	Результат = Истина;
	Если Таблица1.Количество() <> Таблица2.Количество() Тогда
		Результат = Ложь;
	КонецЕсли;
	Если Результат Тогда
		Для Счетчик = 0 По Таблица1.Количество() - 1 Цикл
			Если Не ОбщегоНазначенияУТКлиентСервер.СтруктурыРавны(
						Таблица1[Счетчик],
						Таблица2[Счетчик],
						МассивКолонок) Тогда
				Результат = Ложь;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли; 
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли